{
    "CDSDS100": {
        "id": "DS100",
        "name": "Data Speak Louder Than Words",
        "prereqs": "",
        "content": "This course introduces students to three perspectives that are fundamental to  their ability to reason with data: critical thinking, inferential thinking, and  computational thinking. Through data modeling and visualization, students will  construct and communicate arguments that are rooted in data. The course expects  only basic computer knowledge and teaches concepts and skills in computer  programming (Python), linear regression, and statistical inference. The course  delves into dilemmas surrounding data analysis, such as balancing individual  privacy and social utility, and prepares students for the data driven world all  around us. Students with interests from politics to sports, finance to journalism,  entrepreneurship to smart cities, etc., can use the knowledge of data science they  gain in this class to enhance those interests. Not to mention a grounding for  students who want to pursue the field of data science itself. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry 1, Digital/Multimedia Expression, Research and Information Literacy.  BU Hub   Learn More  Social Inquiry IDigital/Multimedia ExpressionResearch and Information Literacy",
        "prof": [],
        "reviews": []
    },
    "CDSDS110": {
        "id": "DS110",
        "name": "Introduction to Data Science with Python",
        "prereqs": "",
        "content": "CDS DS 110 is the first in a two-course sequence (leading to CDS DS 210) that   builds students' competence   in computing techniques central to data science.   Students will use Python to explore fundamental CS  concepts and processes used  in  data science with a focus on descriptive data analysis, including data    structures, development of  functions and more advanced recursion, object- oriented  programming, data  processing and data  visualization. Numpy, pandas,  and  matplotlib will be used to analyze real-world data. Prior experience with  Python  is not required.    BU Hub   Learn More  Quantitative Reasoning ITeamwork/Collaboration",
        "prof": [],
        "reviews": []
    },
    "CDSDS120": {
        "id": "DS120",
        "name": "Foundations of Data Science",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: =",
        "prof": [],
        "reviews": []
    },
    "CDSDS121": {
        "id": "DS121",
        "name": "Foundations of Data Science",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CDSDS120 OR equivalent.",
        "prof": [],
        "reviews": []
    },
    "CDSDS122": {
        "id": "DS122",
        "name": "Foundations of Data Science",
        "prereqs": "Undergraduate Prerequisites: CDSDS120 OR equivalent",
        "content": "CDS DS 122 is the third in a three-course sequence (with CDS DS 120 and CDS DS      121) that introduces students to theoretical foundations of Data Science. DS 122      covers topics in probability (including common probability distributions,      conditional probability, independence, Bayes Theorem, prior and posterior      distributions, sampling, and the central limit theorem), statistics (including      maximum likelihood), basic numerical optimization (including gradient descent      methods), and topics in calculus (including sequences and series). Knowledge of      a programming language (such as Python) is expected.  Effective Spring 2022,  this course fulfills a single unit in each of the following BU Hub areas:  Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
        "prof": [],
        "reviews": []
    },
    "CDSDS199": {
        "id": "DS199",
        "name": "CDS Workshops (1 credit)",
        "prereqs": "",
        "content": "DS 199 workshops provide students the opportunity to develop elective skills and  competencies in computing and data science. Each workshop focuses on a subset of  skills and competencies necessary for students to engage in particular projects  and real-world experiences. Participation in projects pursued within specific co- Labs may require completion of specific workshops. DS 199 workshops will count for  1 credit.",
        "prof": [],
        "reviews": []
    },
    "CDSDS200": {
        "id": "DS200",
        "name": "Undergraduate Internship in Data Science",
        "prereqs": "",
        "content": "This course is intended for undergraduate students interested in completing a summer internship in a data   science industry company. For international students, this course is required to use CPT. This course comes   with a tuition fee and is not repeatable. Please note that this course does not count toward major   requirements, but the 1 credit received from the course does count toward the graduation requirement of  128  credits. A 2.0 GPA is required to participate in DS 200.  This course may be repeated for credit with CDS approval.",
        "prof": [],
        "reviews": []
    },
    "CDSDS209": {
        "id": "DS209",
        "name": "Spark! Software Engineering Immersion",
        "prereqs": "",
        "content": "Students will be introduced to all concepts required to work on a modern web   development project. This course is intentionally taught with very little   prerequisite knowledge to enable students to begin learning these skills earlier   in their college path. Students begin by learning basic skills required to build  a  functioning web application. During the second half of the course, students  will  be allocated to teams and provided a choice of projects to develop over  the course  of the semester. Students will submit their final application as  their final  project on the last day of classes. Effective Fall 2023, this  course fulfills a single unit in each of the following BU Hub areas:  Oral  and/or Signed Communication, Digital/Multimedia Expression,  Teamwork/Collaboration.  BU Hub   Learn More  Oral and/or Signed CommunicationDigital/Multimedia ExpressionTeamwork/Collaboration",
        "prof": [],
        "reviews": []
    },
    "CDSDS210": {
        "id": "DS210",
        "name": "Programming for Data Science",
        "prereqs": "Undergraduate Prerequisites: CDSDS110 OR equivalent",
        "content": "Second course in the CDS DS-110-210 sequence. The first half of DS 210 continues      the Python programming experience begun in  DS-110, with enhanced focus on      machine learning applications. The second half of the course introduces students      to  compiled programming languages, such as Rust, Go and Java, suitable for  building     large projects. Basic data structures  (stacks, queues, priority  queues, binary     search trees), techniques for representing graphs, and basic  graph algorithms      will be explored. Concepts are developed and reinforced  through consideration of     data-driven inquiries in real-world  settings. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Digital/Multimedia Expression, Creativity/Innovation.    BU Hub   Learn More  Quantitative Reasoning IIDigital/Multimedia ExpressionCreativity/Innovation",
        "prof": [],
        "reviews": []
    },
    "CDSDS219": {
        "id": "DS219",
        "name": "Software Engineering Career Prep Workshop",
        "prereqs": "",
        "content": "Taught by industry software veterans who serve as Spark! Engineers in Residence  in CDS, this 2-credit course presents students with an unadulterated view of  what they need to know as they take on software engineering projects, in  preparation for careers as full-stack software/data engineers. From a brass  tacks perspective, the course covers a number of tactical topics. The course  covers the language of modern software development including patterns, source  control, pull requests, open source, containerization, virtualization, and agile  vs waterfall development methods. Additionally, the course introduces students  to a few of the specialized professional software engineering and DevOps roles  in industry.",
        "prof": [],
        "reviews": []
    },
    "CDSDS280": {
        "id": "DS280",
        "name": "Spark! UX/UI Design",
        "prereqs": "",
        "content": "User experience design (UX) and user interface engineering (UI) is the design of user  interfaces and visualization for computer, information, and data products focusing on  maximizing usability and the user experience. Students complete a series of activities  within the UX Design toolkit developed by BU Spark! in collaboration with the Red Hat UX  Design team. Course covers basic steps of the UX Design process, beginning with user  insights and problem definition, empathy maps around personas, to user stories and lo- fidelity wireframes or story maps, to brand design and high fidelity wireframes. Effective Spring 2022, this course fulfills a single unit in the following BU Hub area: Digital/Multimedia Expression.  BU Hub   Learn More  Digital/Multimedia Expression",
        "prof": [],
        "reviews": []
    },
    "CDSDS288": {
        "id": "DS288",
        "name": "Spark! Workshop on Translating Computing & Data Science Concepts and Technologies   through Storytelling",
        "prereqs": "",
        "content": "This course will cover the basics of storytelling as applied to complex technology  concepts, products, and outputs. Students will learn how to define the basic  elements of a story and to craft compelling narratives using words, images, and  other artifacts as applied to computing and data science topics and products.",
        "prof": [],
        "reviews": []
    },
    "CDSDS290": {
        "id": "DS290",
        "name": "Spark! Civic Tech Research Design Workshop",
        "prereqs": "",
        "content": "This workshop focuses on how we learn from data. How do we identify and analyze    relationships in our data? What conclusions can we draw from our data, and how   applicable  are our conclusions to broader contexts? How do we communicate   effectively about our data  and analyses? How can we be critical consumers of   data and research, and identify issues  and limitations in how data is used by   data scientists, journalists, academics, and others?  Effective Spring 2023,   this course fulfills a single unit in the following BU Hub area: Research and   Information Literacy.  Students must register for both DS290 and DS292.  BU Hub   Learn More  Research and Information Literacy",
        "prof": [],
        "reviews": []
    },
    "CDSDS291": {
        "id": "DS291",
        "name": "Spark! Exploring DEI in Tech",
        "prereqs": "",
        "content": "This workshop will explore topics related to diversity,  equity, inclusion, and   justice (DEIJ) in the technology sector. The course will implement the  theory and  practice of DEIJ across the tech  sector. Students will start by gaining a  foundational  understanding of the concepts of identity, intersectionality, and   inclusive dialogue. They will  then apply this framework to understand issues of  DEIJ in the tech sector in Academia and   business, and the different technology  domains from AI to hardware. The second part of the course  will be focused on     allyship and action and includes a final project where students will use an   intersectional lens to assess a problem  they are passionate about and develop  solutions they  believe can have impact. Through this course, students will learn     how to engage in and  facilitate impactful discussions about diversity, equity,  inclusion and justice. Effective Spring 2022, this course fulfills a single unit in the following BU Hub area: The Individual in Community.  BU Hub   Learn More  The Individual in Community",
        "prof": [],
        "reviews": []
    },
    "CDSDS292": {
        "id": "DS292",
        "name": "Spark! Civic Tech Toolkit Workshop",
        "prereqs": "Undergraduate Prerequisites: CDS DS 290.",
        "content": "This workshop introduces students to a variety of data sources and methodologies  applicable for studying questions around civic life in a variety of settings  e.g. elections, housing, policing, economic development, and more. While we will  primarily focus on data used in the United States (including U.S. Census data,  voter files, and other public records), these skills are applicable to civic  research globally. We will also learn how to conduct analysis from start (a  vague question or assignment) to finish (a rigorous and careful analysis that  acknowledges its limitations). This course is taught using both R and Python;  students must possess the ability to manipulate and analyze data in one of these  languages. This course fulfills a single unit in the following BU Hub area: The  Individual in Community.   BU Hub   Learn More  The Individual in Community",
        "prof": [],
        "reviews": []
    },
    "CDSDS299": {
        "id": "DS299",
        "name": "CDS Workshops (2 credits)",
        "prereqs": "",
        "content": "DS299 workshops provide students the opportunity to develop elective skills   and   competencies in computing and data science. Each workshop focuses on a subset of skills and   competencies necessary for students to engage in particular projects and real-world  experiences.  Participation in projects pursued within specific co-Labs may require  completion of specific  workshops. See CDS website for Spring 2022 course information:  https://www.bu.edu/cds-faculty/academics/undergraduate/courses/",
        "prof": [],
        "reviews": []
    },
    "CDSDS310": {
        "id": "DS310",
        "name": "Data Mechanics",
        "prereqs": "Undergraduate Prerequisites: CDSDS210",
        "content": "Course focused on developing students' capacity to design and implement data  flows and the  computational workflows meant to inform online/offline decision- making within large  systems. Students explore the data science lifecycle,  including question formulation, data  collection and cleaning (data wrangling),  exploratory data analysis and visualization,  statistical inference and  prediction, and decision-making. Relational (SQL) and MapReduce  (noSQL)  paradigms used to assemble analysis, optimization, and decision-making  algorithms  to track and scale data. Effective Fall 2023, this course fulfills a  single unit in each of the following BU Hub areas Quantitative Reasoning II,  Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
        "prof": [],
        "reviews": []
    },
    "CDSDS320": {
        "id": "DS320",
        "name": "Algorithms for Data Science",
        "prereqs": "Undergraduate Prerequisites: CDSDS121 or equivalent AND CDSDS210 or equivalent",
        "content": "This course covers the fundamental principles underlying the design and analysis of  algorithms. We will walk through classical design methods, such as greedy algorithms, design  and conquer, and dynamic programming, focusing on applications in data science. We will also  study algorithmic methods more specific to data science and machine learning. The course  places a particular emphasis on algorithmic efficiency, crucial with large and/or streaming  data sets, for which multiple scans of data are infeasible, including the use of  approximation and randomized algorithms. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
        "prof": [],
        "reviews": []
    },
    "CDSDS340": {
        "id": "DS340",
        "name": "Introduction to Machine Learning and AI",
        "prereqs": "Undergraduate Prerequisites: CDSDS320",
        "content": "This course instructs students in key algorithms for classic artificial  intelligence (AI) and  modern machine learning (ML). Along the way, we seek to  explore what kinds of problems these  techniques are good and bad at, and build  intuition for what makes a good search or machine  learning problem. The primary assessment tools will be programming problem sets in  Python, using  Jupyter notebooks.  Effective Fall 2022, this course fulfills a  single unit in each of the  following BU Hub areas: Ethical Reasoning,  Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IIEthical ReasoningCritical Thinking",
        "prof": [],
        "reviews": []
    },
    "CDSDS380": {
        "id": "DS380",
        "name": "Data, Society and Ethics",
        "prereqs": "Undergraduate Prerequisites: CDSDS110 AND CDSDS320",
        "content": "This course develops students' ability to critically examine and question the  interplay between data science and computational technologies on the one hand,  and society and public policy on the other. Students will complete exercises to  demonstrate their facility with key ethics tools and techniques, and analyze a  series of real-world case studies presented alongside ethical tools and analyses  that are useful both for staying alert to emerging ethical challenges and  responding to them as they arise in both employment settings and everyday life.   Effective Fall 2022, this course fulfills a single unit in each of the following  BU Hub areas: Ethical Reasoning, Social Inquiry II, Research and Information  Literacy.   BU Hub   Learn More  Ethical ReasoningSocial Inquiry IIResearch and Information Literacy",
        "prof": [],
        "reviews": []
    },
    "CDSDS381": {
        "id": "DS381",
        "name": "Social Justice for Data Science",
        "prereqs": "",
        "content": "Society is becoming increasingly digitized and datafied. Important decisions  impacting criminal justice, housing, finance, labor, healthcare, and education  are frequently determined by or are aided by artificially intelligent  algorithmic technologies that are built and trained on large datasets. The rise  in these technologies presents a challenge for social justice. Though often  presented as neutral decision aids, these technologies often produce harmful  predictions that operate to reinforce old legacies of racial, class, gender, and  heteropatriarchal subordination. Datafication practices, computational  techniques, legal doctrine, and policy play a key role in facilitating these  disparate outcomes. This course will center on the complicated relationship  between social justice and data science. The course will introduce students to  the historical and current role of datafication and computation practices in  social subordination.  Students will leave the course having developed the skill  set needed to identify and critically engage with the social justice challenges  posed by these new technologies.",
        "prof": [],
        "reviews": []
    },
    "CDSDS453": {
        "id": "DS453",
        "name": "Crypto for Data Science",
        "prereqs": "Undergraduate Prerequisites: DS-122 and DS-320, or equivalent.",
        "content": "CDS DS 453 investigates techniques for performing trustworthy data analyses  without  a trusted party, and for conducting data science without data. The first  half of the  course investigates cryptocurrencies, the blockchain technology  underpinning them,  and the incentives for each participant, while the second half  of the course focuses  on privacy and anonymity using advanced tools from  cryptography. The course  concludes with a broader exploration into the power of  conducting data science  without being able to see the underlying data.",
        "prof": [],
        "reviews": []
    },
    "CDSDS457": {
        "id": "DS457",
        "name": "Law for Algorithms",
        "prereqs": "",
        "content": "Algorithms - those information-processing machines designed by humans - reach  ever more deeply into our lives, creating alternate and sometimes enhanced  manifestations of social and biological processes. In doing so, algorithms yield  powerful levers for good and ill amidst a sea of unforeseen consequences. This  crosscutting and interdisciplinary course investigates several aspects of  algorithms and their impact on society and law. Specifically, the course  connects concepts of proof, verifiability, privacy, security, trust, and  randomness in computer science with legal concepts of autonomy, consent,  governance, and liability, and examines interests at the evolving intersection  of technology and the law. Grades will be based on a combination of short weekly  reflection papers and a final project, to be completed collaboratively in mixed  teams of law and computer and data science students. This course will include  attendees from the computer science faculty, students and scholars based at  Boston University and UC Berkeley.",
        "prof": [],
        "reviews": []
    },
    "CDSDS481": {
        "id": "DS481",
        "name": "Spark! Data Science for Good",
        "prereqs": "",
        "content": "This course enables students to tackle real world data challenges related to a  more equitable and just society. Students will work in teams on projects  addressing pressing societal challenges in the public sphere, provided by partners  from the public sector. Course emphasizes teamwork, client/project management,  data collection/engineering, analytics and/or software development, testing and  delivery of technical artifacts, and research and presentation of final  deliverables",
        "prof": [],
        "reviews": []
    },
    "CDSDS482": {
        "id": "DS482",
        "name": "Responsible AI, Law, Ethics & Society",
        "prereqs": "Undergraduate Prerequisites: CDSDS100/CDSDS110 (Intro to data science OR equivalent) and CDSDS340 (intro to ML and AI OR equivalent)",
        "content": "Permission is required to register for this course, please fill out an application form here - https://bit.ly/3sv70c3  Course page:  https://learn.responsibly.ai/. Instructor: shlomi@bu.edu. This course addresses the  deployment  of Artificial Intelligence systems in multiple domains of society, and how this raises  fundamental challenges  and concerns, such  as accountability, liability,  fairness, transparency and  privacy. Tackling these   challenges calls for an interdisciplinary  approach: deconstructing these   issues by discipline and  reconstructing with an integrated mindset, principles and practices between  data science, ethics and  law.  This unique course will bring together students from either computing  and data science disciplines or law and  public   policy disciplines from multiple institution. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry II, Ethical Reasoning, Teamwork/Collaboration.  BU Hub   Learn More  Ethical ReasoningSocial Inquiry IITeamwork/Collaboration",
        "prof": [],
        "reviews": []
    },
    "CDSDS488": {
        "id": "DS488",
        "name": "Spark! UX Design X-Lab Practicum",
        "prereqs": "Undergraduate Prerequisites: CDSDS280 OR equivalent",
        "content": "This course gives students an opportunity to apply methods and practices of user experience design to real-world  projects. Students work in teams to address needs of industry partners for applying interactive software to solve  practical problems. Addresses all phases of the user experience design process from user research and discovery to  design and validation, with a focus on mastering techniques and methods for learning about users, applying design  thinking methods to conceive and iterate on solutions, and validating designs through user testing and feedback.",
        "prof": [],
        "reviews": []
    },
    "CDSDS490": {
        "id": "DS490",
        "name": "Directed Study in Computing & Data Sciences",
        "prereqs": "",
        "content": "Directed study in Computing & Data Sciences provides students the opportunity to  complete directed research in a selected topic not covered in a regularly  scheduled course under the supervision of a faculty member. Student and  supervising faculty member arrange and document expectations and requirements.  Examples include in-depth study of a special topic or independent research  project.",
        "prof": [],
        "reviews": []
    },
    "CDSDS499": {
        "id": "DS499",
        "name": "CDS Practicum Course",
        "prereqs": "Undergraduate Prerequisites: consent of instructor",
        "content": "Courses engage students in interdisciplinary   computing and data science  projects. Projects may support CDS co-Labs, in   partnership with internal and  external organizations. Opportunities to connect   computing and data sciences  with domain-specific knowledge and expertise to   advance co-Lab priorities.",
        "prof": [],
        "reviews": []
    }
}