[
    {
        "ENGEC311": {
            "id": "EC311",
            "name": "Introduction to Logic Design",
            "prereqs": "Undergraduate Prerequisites: Sophomore standing.",
            "content": "Introduction to hardware building blocks used in digital computers. Boolean   algebra, combinatorial and sequential circuits: analysis and design. Adders,   multipliers, decoders, encoders, multiplexors. Programmable logic devices:  read- only memory, programmable arrays, Verilog. Counters and registers.  Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC327": {
            "id": "EC327",
            "name": "Introduction to Software Engineering",
            "prereqs": "Undergraduate Prerequisites: ENG EK 125.",
            "content": "This course aims to introduce students to software design, programming  techniques, data structures, and software engineering principles. The course is  structured bottom up, beginning with basic hardware followed by an  understanding of machine language that controls the hardware and the assembly  language that organizes that control. It then proceeds through fundamental  elements of functional programming languages, using C as the case example, and  continues with the principles of object-oriented programming, as principally  embodied in C++ but also its daughter languages Java, C#, and objective C. The  course will conclude with an introduction to elementary data structures and  algorithmic analysis. Throughout, the course develops core competencies in  software engineering, including programming style, optimization, debugging,  compilation, and program management, utilizing a variety of Integrated  Development Environments and operating systems.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC330": {
            "id": "EC330",
            "name": "Applied Algorithms for Engineers",
            "prereqs": "Undergraduate Prerequisites: ENG EC 327; Recommended: CAS MA 193",
            "content": "Introduction to the general concept of algorithms. Efficiency and run-time of  algorithms. Graph algorithms, priority queues, search trees.  Various approaches  to design of algorithms and data structures, together with their applications to  numerical and non-numerical problems.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC400": {
            "id": "EC400",
            "name": "Undergraduate Special Topics in Electrical & Computer Engineering",
            "prereqs": "",
            "content": "Coverage of a specific topic in electrical and computer engineering at the  undergraduate level. Subject matter varies from semester to semester; not offered  every semester.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC401": {
            "id": "EC401",
            "name": "Signals and Systems",
            "prereqs": "Undergraduate Prerequisites: CAS MA 226 and ENG EK 307.",
            "content": "Cannot be taken for credit in addition to ENG BE 401. Continuous-time and   discrete-time signals and systems. Convolution sum, convolution integral.   Linearity, time-invariance, causality, and stability of systems. Frequency   domain analysis of signals and systems. Filtering, sampling, and modulation.   Laplace transform, z-transform, pole-zero plots. Linear feedback systems.   Includes lab. Cannot be taken for credit in addition to ENG BE 403.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC402": {
            "id": "EC402",
            "name": "Control Systems",
            "prereqs": "Undergraduate Prerequisites: CAS MA 226 ; ENG EK 307 ; ENG EC 401.",
            "content": "Analysis of linear feedback systems, their characteristics, performance, and   stability. The Routh-Hurwitz, root-locus, Bode, and Nyquist techniques. Design   and compensation of feedback control systems. Cannot be taken for credit in  addition to ENG ME 403, ENG ME 404, or ENG BE 404.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC410": {
            "id": "EC410",
            "name": "Introduction to Electronics",
            "prereqs": "Undergraduate Prerequisites: ENG EK 307.",
            "content": "Principles of diode, BJT, and MOSFET circuits. Graphical and analytical means of  analysis. Piecewise linear modeling; amplifiers; digital inverters and logic  gates. Biasing and small-signal analysis, microelectronic design techniques.  Time-domain and frequency domain analysis and design. Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC412": {
            "id": "EC412",
            "name": "Analog Electronics",
            "prereqs": "Undergraduate Prerequisites: ENG EC 410.",
            "content": "Continuation of ENG EC 410.  Topics include detailed analysis of differential   amplifiers, design and principles of operational amplifier including multistage   circuit structure, BJT, MOSFET, CMOS, and BiCMOS design principles, active   filters and oscillators, negative and positive feedback, and power devices.   Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC413": {
            "id": "EC413",
            "name": "Computer Organization",
            "prereqs": "Undergraduate Prerequisites: ENG EC 311.",
            "content": "Introduction to the fundamentals and design of computer systems. Topics covered  include computer instruction sets, assembly language programming, arithmetic  circuits, CPU design (data path and control, pipelining), performance evaluation,  memory devices, memory systems including caching and virtual memory, and I/O.  Project using design automation tools. Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC414": {
            "id": "EC414",
            "name": "Introduction to Machine Learning",
            "prereqs": "Undergraduate Prerequisites: ENG EK 103 ; ENG EK 125 ; ENG EK 381.",
            "content": "Linear regression.  Maximum likelihood and maximum a posteriori estimation.  Classification techniques, including na?ve Bayes, k-nearest neighbors, logistic regression, and support vector machines.  Data visualization and feature extraction, including principal components analysis and linear projections.   Clustering.  Introduction to neural networks and deep learning.  Discussion of other modern analysis methods.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC415": {
            "id": "EC415",
            "name": "Software Radios",
            "prereqs": "Undergraduate Prerequisites: ENG EC 401; equivalent",
            "content": "Signal analysis and transmission: amplitude modulation, angle modulation, pulse- amplitude and pulse-code modulation; amplitude shift-keying, frequency shift- keying, phase-shift keying. Case studies of practical communication systems.  Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC417": {
            "id": "EC417",
            "name": "Electric Energy Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EK 307.",
            "content": "This course will present a detailed perspective of electric power systems from generation, transmission, storage, to distribution to end users.  Significant emphasis will be placed on methodologies for reliable and efficient transmission and distribution of power over the grid including challenges for adapting to  renewable resources such as photovoltaics and wind.  Conventional approaches will be presented with emphasis to future technology such as the \"smart grid\".  Analysis of 3-phase power will be presented using numerous examples.  Items such as power system stability, security, reliability will be covered.  Optimization methods, models, simulation techniques, monitoring and control, grid storage technologies, and micro-grids will also be discussed.  Power electronics will be introduced specifically in reference to high voltage circuits. Finally, planning for large numbers of electric vehicles will present new challenges to the effective distribution of power which will be discussed from both centralized and decentralized approaches.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC418": {
            "id": "EC418",
            "name": "Introduction to Reinforcement Learning",
            "prereqs": "Undergraduate Prerequisites: Students must either take all three of MA225, EK103, and EK 381 (Multi-variable Calculus, Linear Algebra, Probability, or their equivalents) or all three of DS 120, 121, 122 (Foundations of Data Scien",
            "content": "Reinforcement learning is a subfield of artificial intelligence which deals with  learning from repeated interactions with an environment. Reinforcement learning  is the basis for algorithms for playing strategy games such as Chess, Go,  Backgammon, and Starcraft, as well as a number of algorithms throughout  robotics, operations research, and other fields of engineering. This course will  cover the fundamental algorithms of reinforcement learning, focusing on the core  principles underlying these methods. Topics covered will include Dynamic  Programming, Markov Decision Processes, Value Iteration, Policy Iteration,  Temporal Difference Methods and Monte Carlo, Function Approximation in  Reinforcement Learning and Neural Networks",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC440": {
            "id": "EC440",
            "name": "Introduction to Operating Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EC 327.",
            "content": "Operating system concepts and design objectives. Concurrent processes, process  synchronization, and deadlocks. Resource management including virtual memory, CPU  scheduling, and secondary storage. File structures, input/output, and distributed  systems. Case studies of popular operating systems.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC441": {
            "id": "EC441",
            "name": "Introduction to Computer Networking",
            "prereqs": "Undergraduate Prerequisites: ENG EK 381; ENGEC327 and ENGEC401 recommended",
            "content": "Computer networks, focusing on the Internet. Application protocols (Web, E- mail), basics of socket programming, major Internet protocols (TCP and IP),  fundamental aspects of routing and reliable data transfer over networks, medium  access protocols, wired and wireless Local Area Networks (LANs) technologies.  Hands-on laboratory modules on client-server programming, Internet experiments,  and protocol implementation. Includes lab.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC444": {
            "id": "EC444",
            "name": "Smart and Connected Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EC 311 and ENG EC 327.",
            "content": "Hands-on introductory course to cyber-physical and IoT systems. Microcontrollers: integrated development environments (ISEs), architecture, and I/O interfaces. Hardware interfacing of systems: formal design and specifications, real-time OS, programming, and control. IoT systems: smart phones, wireless personal area networks (WPANs), IP gateways, mobile cloud computing, reliability, security, and privacy. Course culminates with a team project.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC447": {
            "id": "EC447",
            "name": "Software Design",
            "prereqs": "Undergraduate Prerequisites: ENGEC327",
            "content": "Object-oriented software design for desktop applications with a graphical user   interface. C# and Microsoft .NET programming assignments. Provides a solid   foundation in modern programming for engineering and other applications.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC451": {
            "id": "EC451",
            "name": "Directed Study",
            "prereqs": "",
            "content": "Student may, under the supervision of a faculty member, undertake individual  study of a subject relevant to electrical, computer, and systems engineering, if  the subject is not covered in a regularly scheduled course. Tangible evidence of  achievement must be submitted at the end of the semester.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC455": {
            "id": "EC455",
            "name": "Electromagnetic Systems I",
            "prereqs": "Undergraduate Prerequisites: CAS PY 212 and CAS MA 226.",
            "content": "Time varying electric and magnetic fields. Maxwell equations. Electromagnetic   waves. Propagation, reflection, and transmission. Remote sensing applications.   Radio frequency coaxial cables, microwave waveguides, and optical fibers.   Microwave sources and resonators. Antennas and radiation. Radio links, radar,   and wireless communication systems. Electromagnetic effects in high-speed   digital systems.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC456": {
            "id": "EC456",
            "name": "Electromagnetic Systems II",
            "prereqs": "Undergraduate Prerequisites: ENG EC 455.",
            "content": "Electric field, energy, and force. Lorenz force. Dielectric materials. Steady   electric currents. Magnetic field, energy, and force. Magnetic materials.   Applications of electrostatics, magnetostatics, and electrodynamics.   Electromagnetic waves in dielectric and conducting materials. Solution techniques   for electromagnetic fields and waves.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC463": {
            "id": "EC463",
            "name": "Senior Design Project I",
            "prereqs": "Undergraduate Prerequisites: ENG EK 210; senior standing; CAS WR 150/1/2/3 required.",
            "content": "Development of the technical, communication, personal, and team skills   needed    for successful design in electrical and computer engineering.   Specifications    and standards, information collection, design strategies,   modeling, computer-   aided design, optimization, system design, failure and   reliability, human    factors. Oral and written communication of technical   information. Team   dynamics  and ethical issues in design. Design project for   a small-scale   electrical or  computer system. Preparation of detailed   proposals for senior   design projects  in the following semester. Includes   lab.    Effective Fall   2020, this course fulfills a single unit in each of  the following BU Hub areas:   Digital/Multimedia Expression, Writing-Intensive  Course, Research and   Information Literacy.  BU Hub   Learn More  Digital/Multimedia ExpressionResearch and Information LiteracyWriting-Intensive Course",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC464": {
            "id": "EC464",
            "name": "Senior Design Project II",
            "prereqs": "Undergraduate Prerequisites: ENG EC 463; First Year Writing Seminar (e.g., WR 100 or WR 120)",
            "content": "Continuation of a team project in an area of electrical and computer    engineering, as proposed in EC 463. Application of technical, communication,    personal, and team skills. Oral and written communication of technical    information, including progress reports, technical memos, final report, and   oral  presentations. Includes lab.  Effective Spring 2021, this course fulfills  a single unit in each of the following BU Hub areas: Oral and/or Signed  Communication, Writing-Intensive Course.  BU Hub   Learn More  Oral and/or Signed CommunicationWriting-Intensive Course",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC467": {
            "id": "EC467",
            "name": "Senior Thesis",
            "prereqs": "Undergraduate Prerequisites: ENG EC 463; First Year Writing Seminar (e.g., WR 100 or WR 120) and senior standing and departmental approval.",
            "content": "Well-prepared students may choose to do a formal senior thesis under the direct    guidance of a departmental faculty member. Students selecting this option must    obtain petitioned approval before the beginning of the semester of thesis    registration.  Effective Spring 2021, this course fulfills a single unit in each   of the following BU Hub areas: Oral and/or Signed Communication, Writing-  Intensive Course.  BU Hub   Learn More  Oral and/or Signed CommunicationWriting-Intensive Course",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC471": {
            "id": "EC471",
            "name": "Physics of Semiconductor Devices",
            "prereqs": "Undergraduate Prerequisites: CAS PY 313 or CAS PY 354.",
            "content": "This course addresses the theory of semiconductors and semiconductor electronic   devices. The section on the theory of semiconductor includes their crystal   structure, energy bands, and carrier concentration in thermal equilibrium as   well as carrier transport phenomena (drift, diffusion, generation and   recombination, tunneling, high field effects, and thermionic emission). The   section on electronic devices addresses the theory of p-n junctions and   heterojunctions, of Bipolar Junction Transistors (BJT), Thyristors, Metal Oxide   Semiconductor (MOS) Capacitors and MOS Field Effect Transistors (MOSFETs).",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC500": {
            "id": "EC500",
            "name": "Special Topics in Electrical and Computer Engineering",
            "prereqs": "Undergraduate Prerequisites: senior standing or consent of instructor.",
            "content": "Specific prerequisites vary according to topic. Coverage of a specific topic in electrical, computer, or systems engineering. Subject varies from year to year and is generally from an area of current or emerging research.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC501": {
            "id": "EC501",
            "name": "Dynamic System Theory",
            "prereqs": "Undergraduate Prerequisites: Familiarity with differential equations and matrices at the level of ENG ME 404 or CAS MA 242, or consent of instructor.",
            "content": "Introduction to analytical concepts and examples of dynamic systems and control. Mathematical description and state space formation of dynamic systems; modeling, controllability, and observability. Eigenvector and transform analysis of linear systems including canonical forms. Performance specifications. State feedback: pole placement and the linear quadratic regulator. Introduction to MIMO design and system identification using computer tools and laboratory experiments. Same as ENG ME 501 and ENG SE 501. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC503": {
            "id": "EC503",
            "name": "Introduction to Learning from Data",
            "prereqs": "Undergraduate Prerequisites: ENG EK 381.",
            "content": "This is an introductory course in statistical learning covering the basic theory, algorithms, and applications. This course will focus on the following major classes of supervised and unsupervised learning problems: classification, regression, density estimation, clustering, and dimensionality reduction. Generative and discriminative data models and associated learning algorithms of parametric and non-parametric varieties will be studied within both frequentist and Bayesian settings in a unified way. A variety of contemporary applications will be explored through homework assignments and a project.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC504": {
            "id": "EC504",
            "name": "Advanced Data Structures",
            "prereqs": "Undergraduate Prerequisites: ENG EC 330.",
            "content": "Review of basic data structures and Java syntax. Data abstraction and object-oriented design in the context of high-level languages and databases. Design implementation from the perspective of data structure efficiency and distributed control. Tailoring priority queues, balanced search trees, and graph algorithms to real-world problems, such as network routing, database management, and transaction processing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC505": {
            "id": "EC505",
            "name": "Stochastic Processes",
            "prereqs": "Undergraduate Prerequisites: ENG EC 401 and CAS MA 142; or equivalent and either ENGEK381 or ENGEK500.",
            "content": "Introduction to discrete and continuous-time random processes. Correlation and power spectral density functions. Linear systems driven by random processes. Optimum detection and estimation. Bayesian, Weiner, and Kalman filtering.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC508": {
            "id": "EC508",
            "name": "Wireless Communication",
            "prereqs": "Undergraduate Prerequisites: ENG EK 103 ; ENG EK 381 ; ENG EC 401.",
            "content": "Fundamentals of wireless communication from a physical layer perspective.  Multipath signal propagation and fading channel models. Design of constellations  to exploit time, frequency, and spatial diversity. Reliable communication and  single-user capacity.  Interference management, multiple-access protocols, and  multi-user capacity.  Cellular uplink and downlink.  Multiple-antenna systems  and architectures.  Connections to modern wireless systems and standards.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC511": {
            "id": "EC511",
            "name": "Software Systems Design",
            "prereqs": "Undergraduate Prerequisites: ENG EC 312.",
            "content": "Concept of software product life cycle. Various forms of a software product from requirements definition through operation and maintenance. Life cycle models and the activities performed in each phase. Role of rapid prototyping in requirements analysis and design. Design concepts and design strategies. Comparative evaluation of requirements definition and design methods. Analysis and design validation. Small-team projects involving architectural design and software specification.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC512": {
            "id": "EC512",
            "name": "Enterprise Client-Server Software Systems Design",
            "prereqs": "Undergraduate Prerequisites: Senior standing or consent of instructor. EC447 is recommended.",
            "content": "Examination of past, current, and emerging technologies. Client side technologies    including DHTML, CSS, scripting, and proprietary applications. Legacy server side    technologies including CGI, HTTP protocol, and active server pages. Current server    technologies including ASP.NET, XM, web services, SQL databases, streaming media,    and middleware. Design and implementation of solutions involving database    connectivity, session state, security requirements, SSL, and authentication of    clients. Assignments involving design through implementation.   Students must be fully competent in an object oriented programming language (C++,  C#, or Java preferred). Familiarity with web technologies such as HTML, scripting,  XML, etc. is helpful. Programming experience with a graphical user environment is  also very desirable.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC513": {
            "id": "EC513",
            "name": "Computer Architecture",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 413.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC514": {
            "id": "EC514",
            "name": "Simulation",
            "prereqs": "Undergraduate Prerequisites: ENG ME 308 or ENG EC 381; ENG EC 127 or knowledge of a general purpose programming language.",
            "content": "Modeling of discrete event systems and their analysis through simulation. Systems considered include, but are not limited to, manufacturing systems, computer-communication networks, and computer systems. Simulating random environments and output analysis in such contexts. A simulation language is introduced and is the main tool for simulation experimentation. Same as ENG ME 514; students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC516": {
            "id": "EC516",
            "name": "Digital Signal Processing",
            "prereqs": "Undergraduate Prerequisites: ENG EC 401 and ENG EK 381.",
            "content": "Advanced structures and techniques for digital signal processing and their properties in relation to application requirements such as real-time, low-bandwidth, and low-power operation. Optimal FIR filter design; time-dependent Fourier transform and filterbanks; Hilbert transform relations; cepstral analysis and deconvolution; parametric signal modeling; multidimensional signal processing; multirate signal processing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC517": {
            "id": "EC517",
            "name": "Introduction to Information Theory",
            "prereqs": "Undergraduate Prerequisites: ENG EK 381.",
            "content": "Discrete memoryless stationary sources and channels; Information measures on discrete and continuous alphabets and their properties: entropy, conditional entropy, relative entropy, mutual information, differential entropy; Elementary constrained convex optimization; Fundamental information inequalities: data-processing, and Fano's; Block source coding with outage: weak law of large numbers, entropically typical sequences and typical sets, asymptotic equipartition property; Block channel coding with and without cost constraints: jointly typical sequences, channel capacity, random coding, Shannon's channel coding theorem, introduction to practical linear block codes; Rate-distortion theory: Shannon's block source coding theorem relative to a fidelity criterion; Source and channel coding for Gaussian sources and channels and parallel Gaussian sources and channels (water-filling and reverse water-filling); Shannon's source-channel separation theorem for point-to-point communication; Lossless data compression: Kraft's inequality, Shannon's lossless source coding theorem, variable-length source codes including Huffman, Shannon-Fano-Elias, and Arithmetic codes; Applications; Mini course-project.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC519": {
            "id": "EC519",
            "name": "Speech Processing by Humans and Machines",
            "prereqs": "Undergraduate Prerequisites: ENG EK 381; ENGBE401 or ENGEC401 and MATLAB",
            "content": "Speech (naturally spoken) is the main mode of communication between humans.    Speech technology aims at providing the means for speech-controlled man-machine    interaction. The goal of this course is to provide the basic concepts and    theories of speech production, speech perception, and speech signal processing.    The course is organized in a manner that builds a strong foundation of basics,    followed by a range of signal processing methods for representing and processing    the speech signal.  Same as ENG BE 519. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC520": {
            "id": "EC520",
            "name": "Digital Image Processing and Communication",
            "prereqs": "Undergraduate Prerequisites: ENGEK381 and ENGEC401 or equivalents",
            "content": "Review of signals and systems in multiple dimensions. Sampling of still images. Quantization of image intensities. Human visual system. Image color spaces. Image models and transformations. Image enhancement and restoration. Image analysis. Image compression fundamentals. Image compression standards (JPEG, JPEG-2000). Homework will include MATLAB assignments.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC521": {
            "id": "EC521",
            "name": "Cybersecurity",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 327.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC522": {
            "id": "EC522",
            "name": "Computational Optical Imaging",
            "prereqs": "Undergraduate Prerequisites: ENG EK 103 ; ENG EK 125 ; ENG EC 401.",
            "content": "Recent years have seen the growth of computational optical imaging - optical imaging systems that tightly integrate hardware and computation. The results are the emergence of many new imaging capabilities, such as 3D, super resolution, and extended depth of field. Computational optical imaging systems have a wide range of applications in consumer photography, scientific and biomedical imaging, microscopy, defense, security and remote sensing. This course looks at this new design approach as it is applied to modern optical imaging, with a focus on the tools and techniques at the convergence of physical optical modeling, and signal processing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC523": {
            "id": "EC523",
            "name": "Deep Learning",
            "prereqs": "Undergraduate Prerequisites: A strong mathematical background in calculus, linear algebra, and probability & statistics, as well as prior coursework in machine learningand programming experience in Python.",
            "content": "Mathematical and machine learning background for deep learning. Feed-forward networks.,  Backpropagation. Training strategies for deep networks. Convolutional networks.  Recurrent neural networks. Deep reinforcement learning. Deep unsupervised learning.  Exposure to Pytorch and other modern programming tools. Other recent topics, time  permitting. Same as CAS CS 523. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC524": {
            "id": "EC524",
            "name": "Optimization Theory and Methods",
            "prereqs": "Undergraduate Prerequisites: ENG EK 103 or CAS MA 142.",
            "content": "Introduction to optimization problems and algorithms emphasizing problem formulation, basic methodologies, and underlying mathematical structures. Classical optimization theory as well as recent advances in the field. Topics include modeling issues and formulations, simplex method, duality theory, sensitivity analysis, large-scale optimization, integer programming, interior-point methods, non-linear programming optimality conditions, gradient methods, and conjugate direction methods. Applications are considered; case studies included. Extensive paradigms from production planning and scheduling in manufacturing systems.  Other illustrative applications include fleet management, air traffic flow management, optimal routing in communication networks, and optimal portfolio selection.  Same as ENG EC 674, ENG SE 524, ENG SE 674.  Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC525": {
            "id": "EC525",
            "name": "Optimization for Machine Learning",
            "prereqs": "Undergraduate Prerequisites: ENG EC 414 ; ENG EK 381 ; ENG EK 103.",
            "content": "Efficient algorithms to train large models on large datasets have been critical to  the recent successes in machine learning and deep learning. This course will  introduce students to both the theoretical principles behind such algorithms as well  as practical implementation considerations. topics include convergence properties of  first-order optimization technologies such as stochastic gradient descent, with  particular focus on optimization problems with non-convex losses typically present  in modern deep learning problems. After completing this course, students should be  able to read, and understand optimization algorithms from literature as well as  design and implement new optimization algorithms.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC526": {
            "id": "EC526",
            "name": "Parallel Programming for High Performance Computing",
            "prereqs": "",
            "content": "The explosive advance in High Performance Computing (HPC) and advances in Big Data/Machine Learning and Cloud Computing now provides a fundamental tool in all scientific, engineering, and industrial advances. Software is massively parallel so parallel algorithms and distributed data structures are required. Examples will  be drawn from FFTs, Dense and Sparse Linear Algebra, Structured and unstructured grids. Techniques will be drawn from real applications to simple physical systems using Multigrid Solvers, Molecular Dynamics, Monte Carlo Sampling and Finite Elements with a final student project and team presentation to explore one example in more detail. Coding exercises will be in C++ in the UNIX environment with parallelization using MPI message passing, OpenMP threads and QUDA for GPUs. Rapid prototypes and graphics may use scripting in Python or Mathematica.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC527": {
            "id": "EC527",
            "name": "High Performance Programming with Multicore and GPUs",
            "prereqs": "",
            "content": "Considers theory and practice of hardware-aware programming.  Key theme is obtaining a significant fraction of potential performance through knowledge of the underlying computing platform and how the platform interacts with programs.  Studies architecture of, and programming methods for, contemporary high-performance processors. These include complex processor cores, multicore processors, and graphics processors.  Laboratory component includes use and evaluation of programming methods on these processors through applications such as matrix operations and the Fast Fourier Transform.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC528": {
            "id": "EC528",
            "name": "Cloud Computing",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 327 and ENG EC 330; Undergrads must have taken EC327 or equivalent and preferably anothersoftware course, EC330 or EC440, before taking this course.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC530": {
            "id": "EC530",
            "name": "Software Engineering Principles",
            "prereqs": "Undergraduate Prerequisites: ENG EC 602; ENG EC 602 or equivalent",
            "content": "This class was designed to bring the basic concepts of software engineering together and practice them in real life examples. We will focus on studying different concepts that the students have taken in different classes or were not exposed to that are necessary for their careers. Examples include continuous build and integration, Modular Design, API Design, Rest APIs, Application frameworks, Containers, and Multi-. The class follows a flipped classroom model. Outside of the classroom, the students: study concepts, read assigned papers and tutorials; work on homeworks, which is equivalent to what other classes consider projects.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC533": {
            "id": "EC533",
            "name": "Advanced Discrete Mathematics",
            "prereqs": "Undergraduate Prerequisites: ENGEK103, CAS MA 142 or equivalent",
            "content": "Selected topics in discrete mathematics. Formal systems. Mathematical deduction. Logical concepts. Theorem proving. Sets, relations on sets, operations on sets. Functions, graphs, mathematical structures, morphisms, algebraic structures, semigroups, quotient groups, finite-state machines, their homomorphism, and simulation. Machines as recognizers, regular sets. Kleene theorem.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC534": {
            "id": "EC534",
            "name": "Discrete Stochastic Models",
            "prereqs": "Undergraduate Prerequisites: ENG EK 381 or ENG EK 500.",
            "content": "Markov chains, Chapman-Kolmogorov equation. Classification of states, limiting probabilities, Poisson process and its generalization, continuous-time Markov chains, queuing theory, reliability theory.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC535": {
            "id": "EC535",
            "name": "Introduction to Embedded Systems",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 327; basic knowledge of assembly languages, computer organization and logic circuits, basic knowledge of data structure and algorithms, programming skills in C/C++.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC541": {
            "id": "EC541",
            "name": "Computer Communication Networks",
            "prereqs": "Undergraduate Prerequisites: ENG EC 441 and ENG EK 381.",
            "content": "Basic delay and blocking models for computer communications: M/M/1 queue; Jackson networks and loss networks; analysis of MAC protocols; flow control for data traffic; TCP and active queueing mechanisms for congestion control; traffic shaping and network calculus; packet switch architectures and scheduling algorithms; routing algorithms; flow assignment and fairness.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC543": {
            "id": "EC543",
            "name": "Sustainable Power Systems",
            "prereqs": "Undergraduate Prerequisites: Senior standing or consent of instructor.",
            "content": "Breakthroughs in clean energy generation technologies and the advantage of exploiting efficiently the available work in fossil fuels will render electricity the dominant energy form in a sustainable environment future. We review the key characteristics of Electric Power Transmission and Distribution (T&D) networks and the associated planning and operation requirements that ensure supply adequacy, system security and stability. Capital asset investment and operation cost minimization is discussed in a systems engineering context where the assets as well as the dynamic behavior of generators, T&D networks, and loads interact. Recent developments in the formation of competitive wholesale markets at the High Voltage Transmission system level, the associated market participation and clearing rules and the market clearing optimization algorithms are presented and analyzed in terms of their effectiveness in fostering cost reflective price signals and competitive conditions that encourage optimal distributed/not-centralized investment and operating decisions. Finally, we present T&D congestion and supply-demand imbalance related barriers to the widespread adoption of environmentally friendly and economically efficient technological breakthroughs, and propose a systems engineering and real-time retail-market based coordination of centralized as well as decentralized generation, storage and load management resources that is able to achieve desirable synergies and mitigate these barriers. Same as ENG ME 543 and ENG SE 543. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC544": {
            "id": "EC544",
            "name": "Networking the Physical World",
            "prereqs": "Undergraduate Prerequisites: ENG EC 327; ENG EC 441 recommended, C programming experience required.",
            "content": "Considers the evolution of embedded network sensing systems with the  introduction of wireless network connectivity. Key themes are computing  optimized for resource constrained (cost, energy, memory and storage space)  applications and sensing interfaces to connect to the physical world.  Studies current technology for networked embedded network sensors including  protocol standards. A laboratory component of the course introduces students  to the unique characteristics of distributed sensor motes including  programming, reliable communication, sensing modalities, calibration, and  application development. Same as ENG ME 544 and ENG SE 544. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC545": {
            "id": "EC545",
            "name": "Cyber-Physical Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EC 311 ; ENG EC 327 ; ENG EC 330; Or equivalent knowledge of Boolean algebra and finite state machines.Experience with programming embedded systems (eg EC535) is recommended but not required.",
            "content": "This course introduces students to the principles underlying the design and analysis of cyber-physical systems - computational systems that interact with the physical world. We will study a wide range of applications of such systems ranging from robotics, through medical devices, to smart manufacturing plants. A strong emphasis will be put on building high-assurance systems with real-time and concurrent behaviors. The student will gain both in-depth knowledge and hands-on experience on the specification, modeling, design, and analysis of representative cyber-physical systems. Meets with ENG SE 545. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC551": {
            "id": "EC551",
            "name": "Advanced Digital Design with Verilog and FPGA",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 311 ; ENG EC 413 ; ENG EC 327.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC552": {
            "id": "EC552",
            "name": "Computational Synthetic Biology for Engineers",
            "prereqs": "Undergraduate Prerequisites: ENG EK 125 and ENG EC 327.",
            "content": "This course presents the field of computational synthetic biology through the  lens of four distinct activities: Specification, Design, Assembly, and Test.  Engineering students of all backgrounds are introduced provided an introduction  to synthetic biology and then exposed to core challenges and approaches in each  of the four areas. Homework assignments are provided which allow the students to  use existing computational software to explore each of these themes. In  addition, advanced concepts are presented around data management, design  algorithms, standardization, and simulation challenges in the field. The course  culminates in a group project in which the students apply computational design  methods to an experimentally created system working with graduate students in  the Biological Design Center and the DAMP Lab. Same as ENG BE 552. Students may  not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC555": {
            "id": "EC555",
            "name": "Introduction to Biomedical Optics",
            "prereqs": "Undergraduate Prerequisites: ENG BE 403 or ENG EC 401; Requires senior status.",
            "content": "This course surveys the applications of optical science and engineering to a variety of biomedical problems,  with emphasis on optical and photonics technologies that enable real, minimally-invasive clinical and  laboratory applications. The course teaches only those aspects of the biology itself that are necessary to  understand the purpose of the applications. The first weeks introduce the optical properties of tissue, and  following lectures cover a range of topics in three general areas: 1) Optical spectroscopy applied to diagnosis  of cancer and other tissue pathologies; 2) Photon migration and diffuse optical imaging of subsurface  structures in tissue; and 3) new tissue imaging methods, laser-tissue interactions and other applications of  light for biomedical research. The format of this course is \"semi-flipped.\"  There are assigned readings from  the required textbook, prior to each class. Half of class time will invoke informal lecture and discussion, to  amplify and clarify the readings; and half of the class time will be in the style of a \"flipped\" class, devoted to  working, in small groups, on problems and discussing and understanding the connection to the readings. Dual  listed as ENG EC 555. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC556": {
            "id": "EC556",
            "name": "Optical Spectroscopic Imaging",
            "prereqs": "Graduate Prerequisites: CAS PY 212; EK 125 or equivalent Matlab; PY 212 or equivalent knowledge of light and waves. Suggested: EC 562, EC 555",
            "content": "This introductory graduate-level course aims to teach students how electromagnetic waves and various forms of molecular spectroscopy can be used to study a complex biological system by pushing the physical limits on engineering system design.The course will cover fundamental concepts of optical spectroscopy and microscopy, followed by specific topics covering fluorescence-based , absorption-based, and scattering-based spectroscopic imaging. In addition, this course will provide in-depth discussions of linear and nonlinear spectroscopic imaging in the aspects of theory, instrumentation, image data analysis and enabling applications. Students will learn how to give a concise and informative presentation of a recent literature to the class. Students will be able to challenge their creativity in designing advanced imaging instrument of data analysis methods as part of their course assignments. The students will learn how to write and present a convincing proposal for the required final project to be designed by interdisciplinary teams formed among the students. Same as ENG BE 556. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC560": {
            "id": "EC560",
            "name": "Introduction to Photonics",
            "prereqs": "Undergraduate Prerequisites: CAS PY 313.",
            "content": "Introduction to ray optics; matrix optics; wave optics; Fourier optics; electromagnetic optics including absorption and dispersion. Polarization, reflection and refraction, anisotropic media, liquid crystals, and polarization devices. Guided-wave and fiber optics. Nanophotonics.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC561": {
            "id": "EC561",
            "name": "Error-Control Codes",
            "prereqs": "Undergraduate Prerequisites: CAS MA 193.",
            "content": "Introduction to codes for error detection and correction in communication and computation channels, linear algebra over finite fields, bounds, Shannon?s Theorem, perfect and quasi-perfect codes, probability of error detection, Hamming, BCH, MDS, Reed-Solomon, and non-linear codes. Application of codes to error detection/correction in communication channels, computer memories, processors, and multiprocessor systems. Data compression and data reconciliation by error-detecting or error-correcting codes.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC562": {
            "id": "EC562",
            "name": "Fourier Optics in Engineering",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 ; ENG EK 103 ; CAS PY 313 ; CAS PY 314 ; ENG EK 381 ; ENG EC 401; Proficiency in Matlab programming is expected as well as a backgroundknowledge in electromagnetics. Undergraduate students must talk to the instructor before registering.",
            "content": "The goal of this course is to present a coherent formulation of wave  propagation,  radiation and diffraction phenomena in arbitrary linear systems for  the engineering  design of optical devices in strong partnership with computer  simulations and  engineering-led design projects. The course will introduce  students to the  fundamental techniques that are necessary for the quantitative  analysis of optics- based engineering systems and devices.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC563": {
            "id": "EC563",
            "name": "Fiber Optics and Communications Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EC 311 ; ENG EC 410 ; ENG EC 415 ; ENG EC 560; or consent of instructor",
            "content": "This course will cover the theory light propagation and manipulation in an optical fiber both in the linear and nonlinear regimes. This theory will be used to introduce design, both of optical fibers for transmission as well as for devices and components. The latter part of the course will use these concepts to illustrate applications in which fibers and fiber devices are used. The emphasis will be on telecommunications systems, but the course will also touch upon other emerging applications such as lasers, sensors, biomedical systems and astrophotonics. Two lectures, two hours a week. 4 cr.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC565": {
            "id": "EC565",
            "name": "Introduction to Electromagnetics and Photonics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS PY 212 and CAS MA 226.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC566": {
            "id": "EC566",
            "name": "The Atmosphere and Space Environment",
            "prereqs": "Undergraduate Prerequisites: CAS MA 226 ; CAS PY 212 ; ENG EK 125.",
            "content": "Introduction to the upper atmosphere and ionosphere. The dynamic, electrodynamic, radiative, and chemical processes occurring in the atmosphere from ground level to near-space are developed to establish the conditions found in the upper-atmospheric/ionospheric region. Recent offerings have included numerical simulation of the ionospheric electron density profile. Numerical experiments that change the solar input and neutral atmospheric density, composition, winds, and temperature are then run to study the response of the ionosphere to these factors that control the ionosphere. Recommended for graduate students and advanced undergraduate students in engineering, astronomy, and physics and those with interests in environmental topics.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC568": {
            "id": "EC568",
            "name": "Optical Fibers and WaveGuides",
            "prereqs": "Undergraduate Prerequisites: ENG EC 455; or consent of instructor",
            "content": "Whether it be the FIOS? internet connection at our homes, or fiber lasers  powerful enough to cut metals (many automobile chassis are now made using fiber  lasers), or the ability to perform endoscopic surgery and imaging, or doing  frequency metrology with super-continuum sources (the basis of a few recent  Nobel prizes)... the optical fiber has played a central, often dominant, role in  many applications that impact the way we live. The main function of an optical  fiber is to carry an electromagnetic (in the optical frequency) pulse over  distances ranging from meters to greater than ten thousand kilometers without  distortions. Fibers can also become smart light-pipes when they are  intentionally designed to alter, temporally shape or amplify light pulses.  Moreover, new developments in this field such as photonic bandgap fibers, fiber  nanowires and higher-order mode fibers, are opening up new directions in science  and technology.  This course will introduce the optical fiber waveguide and its  theory of operation. Specifically, the design and impact of the two most  important properties in optical fibers -- dispersion and nonlinearity -- that  govern the evolution of light in optical fibers, will be covered in detail. The  latter part of the course will describe new fibers and fiber-structures that are  active research topics today. One lecture of the course will include a tour of  an actual, industrial-scale fiber fabrication facility.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC569": {
            "id": "EC569",
            "name": "Introduction to Subsurface Imaging",
            "prereqs": "Undergraduate Prerequisites: Senior or graduate standing in ENG, PY, CH, MA, or CS.",
            "content": "Introduction to subsurface imaging using electromagnetic, optical, X-ray, and acoustic waves. Transverse and axial imaging using localized probes (confocal scanning, time of flight, and interferometric techniques). Multiview tomographic imaging: computed axial tomography, diffraction tomography, diffuse optical tomography, electrical impedance tomography, and magnetic resonance imaging. Image reconstruction and inverse problems. Hyperspectral and multisensor imaging.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC570": {
            "id": "EC570",
            "name": "Lasers and Applications",
            "prereqs": "Undergraduate Prerequisites: ENG EC 455.",
            "content": "Review of wave optics. Gaussian, Hermite-Gaussian, Laguerre-Gaussian, and Bessel  optical beams. Planar- and spherical-mirror resonators; microresonators. Photons  and photon streams. Energy levels; absorption, spontaneous emission, and  simulated emission. Thermal and scattered light. Laser amplification and gain  saturation. Laser oscillation. Common lasers and introduction to pulsed lasers.  Photon interactions in semiconductors. LEDs, laser diodes, quantum-confined  lasers, and microcavity lasers. Introductoin to photon detectors. Laboratory  experiments: beam optics; longitudinal laser modes; laser-diode output  characteristics.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC571": {
            "id": "EC571",
            "name": "Digital VLSI Circuit Design",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 311 and ENG EC 410.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC572": {
            "id": "EC572",
            "name": "Computational Methods in Materials Science",
            "prereqs": "Graduate Prerequisites: ENG EC 577; consent of instructor",
            "content": "Introduction to computational materials science. Multi-scale simulation methods;    electronic structure, atomistic, micro-structure, continuum, and mathematical    analysis methods; rate processes and rare events. Materials defect theory;  modeling   of crystal defects, solid micro-structures, fluids, polymers, and  bio-polymers.   Materials scaling theory: phase transition, dimensionality, and  localization.   Perspectives on predictive materials design. Topics covered  include tight binding   theory, density functional theory, and many-body  perturbation theory. Lectures   provide the theoretical framework for  computation. Same as CAS CH 455, GRS CH 572,   ENG MS 508. Students may not  receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC573": {
            "id": "EC573",
            "name": "Solar Energy Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EK 408; graduate standing or permission of the instructor.  ENG EC 471 is suggested.",
            "content": "This course is designed for first year graduate and senior undergraduate  students from engineering disciplines.  It is intended to educate students in  the design and applications of solar energy technology.  It will focus on  fundamentals of solar energy conversion, solar cells, optical engineering,  photoelectrochemical cells, thermoelectric generators, and energy storage and  distribution systems.  The course covers solar energy insolation and global  energy needs, current trends in photovoltaic energy engineering, solar cell  materials science, design and installation of solar panels for residential and  industrial applications and connections to the national grid and cost analysis  of the overall system.  In addition, basic manufacturing processes for the  production of solar panels, environmental impacts, and the related system  engineering aspects will be included to provide a comprehensive state-of-the-art  approach to solar energy utilization.  Same as ENG MS 573. Students may not  take credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC574": {
            "id": "EC574",
            "name": "Physics of Semiconductor Materials",
            "prereqs": "Undergraduate Prerequisites: CAS PY 313 or ENG EC 410; or equivalent",
            "content": "This course teaches the relevant notions of quantum mechanics and solid state physics necessary to understand the operation and the design of modern semiconductor devices.  Specifically,  this course  focuses on the engineering aspects of solid state physics that are important to study the electrical and optical properties of semiconductor materials and devices. Particular emphasis is placed on the analysis of the electronic structure of semiconductor bulk systems and low-dimensional structures, the study of the carrier transport properties and the calculation of the optical response that are relevant to the design and optimization of electronics and photonics semiconductor devices. The students will learn to apply the quantum mechanical formalism to the solution of  basic engineering device problems (quantum wells, wires, and dots, 2D electron gas)  and to perform numerical calculation on more complex systems (band structure calculation of bulk and low dimensional systems). Same as ENG MS 574. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC575": {
            "id": "EC575",
            "name": "Semiconductor Devices",
            "prereqs": "Undergraduate Prerequisites: ENG EC 410 ; ENG EC 455 ; ENG EC 574 ; CAS PY 313; or equivalent.",
            "content": "Fundamentals of carrier generation, transport, recombination, and storage in semiconductors. Physical principles of operation of the PN junction, metal-semiconductor contact, bipolar junction transistor, MOS capacitor, MOSFET (Metal Oxide Semiconductor Field Effect Transistor), JFET (Junction Field Effect Transistor), and bipolar junction transistor. Develops physical principles and models that are useful in the analysis and design of integrated circuits.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC577": {
            "id": "EC577",
            "name": "Electronic Optical and Magnetic Properties of Materials",
            "prereqs": "Undergraduate Prerequisites: CAS PY 313; or equivalent, and CAS MA 225 or CAS MA 226",
            "content": "This course provides an in-depth analysis of solid-state physics as it pertains  to materials science and electrical engineering applications. Students will  develop an understanding of the theory of crystal structures and their  determination via diffraction, as well as the thermal, electrical, and optical  properties of materials that arise from these structures.  Same as ENG MS 577.  Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC578": {
            "id": "EC578",
            "name": "Fabrication Technology for Integrated Circuits",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 410; Senior standing or permission of the instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC579": {
            "id": "EC579",
            "name": "Nano/microelectronic Device Technology",
            "prereqs": "Undergraduate Prerequisites: Senior standing in the engineering, physics, or chemistry disciplines, or consent of instructor.",
            "content": "The main physical processes and manufacturing strategies for the fabrication and manufacture of micro and nanoelectronic devices will be covered, mostly for silicon, although exciting materials such as graphene and carbon nanotubes will also be covered. A key emphasis here will be on electron- hole transport, band structure, basic quantum effects, and the use of engineering and physical effects to alter semiconductor device performance. Photolithography, a significant factor in manufacturability, will be covered in some detail, and to a lesser degree, so will doping methods, diffusion, oxidation, etching, and deposition. The overall integration with methods and tools employed by device and circuit designers will be covered. Same as ENG ME579. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC580": {
            "id": "EC580",
            "name": "Analog VLSI Circuit Design",
            "prereqs": "Undergraduate Prerequisites: ENG EC 412.",
            "content": "Anatomy of an operational amplifier using chip design techniques. Applications of  op amps in wave-shaping circuits, active filters including capacitive switching.  Analog multiplexing and data acquisition circuits, A/D, D/A, S/H are examined.  Frequency selective circuits and interface circuits such as optocouplers are  analyzed.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC582": {
            "id": "EC582",
            "name": "RF/Analog IC Design Fundamentals",
            "prereqs": "Undergraduate Prerequisites: ENG EC 412 or ENG EC 571; or consent of instructor.",
            "content": "Fundamentals related to CMOS and SiGe BICMOS analog circuits for RF  applications. Topics include low noise amplifiers, oscillators, mixers,  demodulators, phase-locked loop, switched capacitor circuits, A/D and D/A  converters, low power design, RF design techniques, and mixed-signal circuitry  typical of modern telecommunications technology. VLSI laboratory exercises  involving the design, layout, and simulation of RF/analog integrated circuits  using Cadence SpectreRF CAD software tools. Real-world examples in advanced  mixed-signal integrated circuit applications, such as a single chip radio.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC583": {
            "id": "EC583",
            "name": "Power Electronics for Energy systems",
            "prereqs": "Undergraduate Prerequisites: ENG EC 410.",
            "content": "Introduction to power electronics with emphasis on conversion circuits for energy systems. DC to DC conversion using buck, boost, and buck-boost converters. DC to AC inverters. Connection to power grid.  Properties of MOS transistors used for high power conversion applications. Properties of magnetic elements and interactions with power circuits.  Applications of power electronic circuits to energy systems, including solar cell installations, wave and wind power, and electric vehicles. High frequency inductors and transformers.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC585": {
            "id": "EC585",
            "name": "Quantum Engineering & Technology (QET)",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 ; ENG EK 125 ; ENG EK 103 ; CAS PY 313; CAS MA 225, EK 125, EK 103, CAS PY 313 or 314. Background knowledge in classical electrodynamics, semiconductors physics, and quantum mechanics. Talk to the instructor before registering if unsure.",
            "content": "This course introduces graduate students to Quantum Engineering and Technology (QET)  by providing a comprehensive and rigorous discussion of the basic principles and  engineering design concepts of quantum coherent structures and devices for  communications, computation, simulation, metrology, and sensing. this course will  provide in-depth discussion of design methods, mathematical techniques, and  engineering applications for the control of coherent quantum systems that drive the  rapidly emerging \"quantum supremacy\" paradigm of computing and information  processing. This course provides a broad yet rigorous foundation of quantum  technology that exploits non-classical correlations and coherent superposition  effects to achieve fundamentally novel optical and electronic functions on photonic  and solid-state devices. A distinctive feature of this course is to present the  material in strong partnership with \"hands-on\" computer simulations that demonstrate  quantum mechanical principles and ideas \"in action\".",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC591": {
            "id": "EC591",
            "name": "Photonics Lab I",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS PY 313.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC601": {
            "id": "EC601",
            "name": "Product Design in Electrical and Computer Engineering",
            "prereqs": "Undergraduate Prerequisites: Graduate Standing or permission of instructor.",
            "content": "Engineers influence their community, society and the world. Engineers build  products and services that can enhance people's lives. The product starts  with an idea and is delivered through research (technical and societal),  design, implementation, testing and support. During this class, students  will experience all of this. The course provides design and practical  insights into building products that involve WEB and mobile app development,  data simulation, analysis and modeling, cloud computing, signal processing  and/or computer vision. In the class, we work on how to take an idea and  concept and translate it into product requirements. Afterwards, we translate  the product requirements into system and engineering requirements. We also  discuss solution selection techniques. We then work on implementing our  ideas into systems and verify that they address the product requirements and  fulfill the concept we started with. During the class, we go over how to  choose solutions to build our products. We also discuss real product  realization, implementations and tradeoffs. The class is taught via an  example product and the class sessions are interactive. Students are divided  into groups where they work in parallel on their projects during class  sessions and hackathons. Teams define their target audience, product  mission, requirements and features. The class adopts agile software  development based on a two-week sprint. Students present their sprint  results to the class.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC602": {
            "id": "EC602",
            "name": "Design by Software",
            "prereqs": "Undergraduate Prerequisites: Graduate standing or permission of instructor.",
            "content": "Software plays a central role in all aspects of electrical and computer   engineering. This course will provide the foundation for effectively using   software as a key part of a career as a professional electrical or computer   engineer.  Fundamentals of software development systems:  system languages,   high-level object-oriented languages, and computational languages. Data   structures and algorithms in problem analysis and design. Strategies for   designing software and  designing with software.  Software design and   development: methodologies, principles and practice. Formalizing software:   management, requirements, specifications, testing. Survey of software   applications in ECE, including  real-time systems, the web, networked   systems, audio, graphics, and video systems, research and engineering   analysis, consumer electronics and computing, instrumentation and   measurement, design, modeling, prototyping, simulation, optimization and   information analysis.  Students can choose projects and assignments with   application to/inspired by/drawn from a  broad array of ECE fields including   the traditional areas of electro-physics/photonics, computer engineering,   and information and data science. Open to graduate students only.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC605": {
            "id": "EC605",
            "name": "Computer Engineering Fundamentals",
            "prereqs": "Undergraduate Prerequisites: Graduate standing or permission of the instructor.",
            "content": "This is an introductory course to computer engineering, focusing on the   hardware/software interface, and presenting a bottom-up view of a computer   system. Topics include logic design: binary arithmetic, combinational and   sequential logic. Computer organization: assembly language programming, CPU   design, and memory systems. Introduction to compilers, operating systems,   and computer networks. Open to graduate students only.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC674": {
            "id": "EC674",
            "name": "Optimization Theory 2",
            "prereqs": "",
            "content": "This course is an introduction to optimization problems and algorithms emphasizing  problem formulation, basic methodologies and the underlying mathematical structures.  We will cover the classical theory as well as the state of the art. The major topics  we will cover are: 1. Theory and algorithms for linear programming. 2. Introduction  to combinatorial problems and methods for handling intractable problems. 3.  Introduction to nonlinear programming. 4. Introduction to network optimization.  Optimization techniques have many applications in science and engineering. To name a  few: * Optimal routing in communication networks. * Transmission scheduling and  resource allocation in sensor networks. * Production planning and scheduling in  manufacturing systems. * Fleet management. * Air traffic flow management by  airlines. * Optimal resource allocation in manufacturing and communication systems.  * Optimal portfolio selection. * Analysis and optimization of fluxes in metabolic  networks. * Protein docking.  Prerequisites: Working knowledge of Linear Algebra and  some degree of mathematical maturity. Same as ENG EC 674, ENG SE 524, ENG EC 674.  Students may not receive credits for both.  BU Hub   Learn More  Teamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC700": {
            "id": "EC700",
            "name": "Advanced Topics in Electrical and Computer Engineering",
            "prereqs": "Undergraduate Prerequisites: Graduate standing or consent of instructor.",
            "content": "Advanced topics of current interest in electrical and computer engineering.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC701": {
            "id": "EC701",
            "name": "Optimal and Robust Control",
            "prereqs": "Undergraduate Prerequisites: ENG EC 501 or ENG ME 501 or ENG SE 501.",
            "content": "This course is aimed at an introduction (with rigorous treatment) to the fundamentals of optimal and robust control.  It will be divided roughly into two parts.  The first will cover aspects of robust control including model reduction, H_2 and H_ infinity control, and feedback control of uncertain systems.  The second will delve into optimal control including topics such as the linear quadratic regulator, the calculus of variations, the maximum principle, and the Hamilton-Jacobi-Bellman equation. Same as ENG ME 701 and ENG SE 701. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC702": {
            "id": "EC702",
            "name": "Recursive Estimation and Optimal Filtering",
            "prereqs": "Undergraduate Prerequisites: ENG EC 505.",
            "content": "State-space theory of dynamic estimation in discrete and continuous time. Linear state-space models driven by white noise, Kalman filtering and its properties, optimal smoothing, non-linear filtering, extended and second-order Kalman filters, and sequential detection. Applications to radar, sonar, and optimal multitarget tracking, parameter identification.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC703": {
            "id": "EC703",
            "name": "No longer offered",
            "prereqs": "",
            "content": "No longer offered",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC707": {
            "id": "EC707",
            "name": "Radar Remote Sensing",
            "prereqs": "Undergraduate Prerequisites: Experience in electromagnetic waves, analog and discrete signal processing, or consent of the instructor.",
            "content": "Principles of radar systems and radar signal analysis with emphasis on environmental remote sensing. Topics include antenna fundamentals, wave propagation/scattering in various media, the radar equation, radar cross-section, target characteristics, ambiguity function, radar system components, pulse compression techniques, and aperture synthesis. Highlighted systems include ground-penetrating radars, synthetic aperture radar (SAR), weather radars, and incoherent scatter radars, and LIDAR.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC708": {
            "id": "EC708",
            "name": "Advanced Process Control",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 402 or ENG EC 501 or ENG ME 507; or equivalent with permission of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC710": {
            "id": "EC710",
            "name": "Dynamic Programming and Stochastic Control",
            "prereqs": "Undergraduate Prerequisites: ENG EK 500; ENGEK381 and ENG EC402 or ENG EC501.",
            "content": "Introduction to sequential decision making via dynamic programming. The principle of optimality as a unified approach to optimal control of dynamic systems and Markovian decision problems. Applications from control theory and operation research include linear-quadratic problems, the discrete Kalman Filter, inventory control, network, investment, and resource allocation models. Adaptive control and numerical solutions through successive approximation and policy iteration, suboptimal control, and neural network applications involving functional approximations and learning. Same as  ENG ME 710 and ENG SE 710. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC713": {
            "id": "EC713",
            "name": "Advanced Computer Systems & Architecture",
            "prereqs": "Undergraduate Prerequisites: ENG EC 513 or ENG EC 535 or ENG EC 527.",
            "content": "This class is designed to enable students to follow the latest developments in  computer systems and architecture. The lectures cover a broad array of recent  subjects, such as memory management in multi-core systems, hardware multi- threading, heterogenous systems, modern operating systems, large-scale system  architectures, virtualization, data center management, energy awareness in  computing systems, system reliability, and emerging areas, such as quantum  computing, and neuromorphic computing. The concepts are reinforced with research  paper readings and hands-on assignments that involve computer system design and  analysis.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC716": {
            "id": "EC716",
            "name": "Advanced Digital Signal Processing",
            "prereqs": "Undergraduate Prerequisites: ENG EC 516.",
            "content": "Selected topics from time-frequency distributions, parametric signal modeling, high-resolution spectral estimation, multi-rate signal processing, multidimensional signal processing, adaptive signal processing, alternative algorithms for DFT computation, symbolic and knowledge based signal processing. Application examples chosen from speech, image, communication, and biomedical applications.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC717": {
            "id": "EC717",
            "name": "Image Reconstruction and Restoration",
            "prereqs": "Undergraduate Prerequisites: ENG EC 516 and ENG EC 505.",
            "content": "Principles and methods of reconstructing images and estimating multidimensional fields from indirect and noisy data; general deterministic (variational) and stochastic (Bayesian) techniques of regularizing ill-posed inverse problems; relationship of problem structure (data and models) to computational efficiency; impact of typically large image processing problems on viability of solution methods; problems in imaging and computational vision including tomography and surface reconstruction. Computer assignments.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC719": {
            "id": "EC719",
            "name": "Statistical Learning Theory",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: ENG EC 414 or ENG EC 503.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC720": {
            "id": "EC720",
            "name": "Digital Video Processing",
            "prereqs": "Undergraduate Prerequisites: ENG EC 516 or ENG EC 505 or ENG EC 520; or equivalent",
            "content": "Review of sampling/filtering in multiple dimensions, human visual system, fundamentals of information theory. Motion analysis: detection, estimation, segmentation, tracking. Image sequence segmentation. Spectral analysis of image sequences. Video enhancement: noise reduction, super-resolution. Video compression: transformation, quantization, entropy coding, error resilience. Video compression standards (H.26X and MPEG families). Future trends in image sequence compression and analysis. Homework and project will require MATLAB programming.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC724": {
            "id": "EC724",
            "name": "Advanced Optimization Theory and Methods",
            "prereqs": "Undergraduate Prerequisites: ENG EC 524; consent of instructor",
            "content": "Introduces advanced optimization techniques. Emphasis on nonlinear optimization and recent developments in the field. Topics include: unconstrained optimization methods such as gradient, conjugate direction, Newton and quasi-Newton methods; constrained optimization methods such as gradient projection, feasible directions, barrier and interior point methods; duality theory and methods; convex duality; and introduction to other advanced topics such as semi-definite programming, incremental gradient methods and stochastic approximation algorithms. Applications drawn from control, production and capacity planning, resource allocation, communication and neural network problems. Same as ENG ME 724 and ENG SE 724.  Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC725": {
            "id": "EC725",
            "name": "Queueing Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EK 500 or ENG EC 505; consent of instructor",
            "content": "Performance modeling using queueing networks analysis of product form and nonproduct form networks, numerical methods for performance evaluation, approximate models of queueing systems, optimal design and control of queueing networks. Applications from manufacturing systems, computer systems, and communication networks. Same as ENG ME 725 and ENG SE 725. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC730": {
            "id": "EC730",
            "name": "Information-Theoretical Design of Algorithms",
            "prereqs": "",
            "content": "Recently developed information-theoretical approach to the analysis and design of computer algorithms. Previous knowledge of information theory or the theory of algorithms is not required, though desirable. Main topics include the complexity of algorithms; P, E, NP, and NP?hard problems; basic concepts of information theory, optimal coding; information-theoretical approach to sorting, order statistics, binary search, decision trees, hashing, minimization of Boolean functions, test, and similar problems; and design of efficient computer algorithms.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC732": {
            "id": "EC732",
            "name": "Combinatorial Optimization and Graph Algorithms",
            "prereqs": "Undergraduate Prerequisites: ENG ME 411 or CAS CS 330; or equivalent course on optimization or algorithms.",
            "content": "of algorithms for the solution of optimization problems with discrete decision  spaces.   Review of linear programming and duality.  Discussion of advanced  network optimization algorithms and matroid optimization.  Approximate algorithms  for NP-Hard optimization problems.  Submodular optimization.  Same as ENG SE 732.   Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC733": {
            "id": "EC733",
            "name": "Discrete Event and Hybrid Systems",
            "prereqs": "Undergraduate Prerequisites: ENG EK 500; or equivalent; consent of instructor",
            "content": "Review of system theory fundamentals distinguishing between time-driven and event-driven dynamics. Modeling of Discrete Event and Hybrid Systems: Automata, Hybrid Automata, Petri Nets, basic queueing models, and stochastic flow models. Monte Carlo computer simulation: basic structure and output analysis. Analysis, control and optimization techniques based on Markov Decision Process theory with applications to scheduling, resource allocation and games of chance. Perturbation Analysis and Rapid Learning methods with applications to communication networks, manufacturing systems, and command-control. Same as ENG ME 733 and ENG SE 733. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC734": {
            "id": "EC734",
            "name": "Hybrid Systems",
            "prereqs": "Undergraduate Prerequisites: ENG SE 501 or ENG EC 501 or ENG ME 501; or consent of instructor.",
            "content": "The course offers a detailed introduction to hybrid systems, which are dynamical systems combining continuous dynamics (modeled by differential equations) with discrete dynamics (modeled by automata). The covered topics include modeling, simulation, stability analysis, verification, and control of such systems. The course contains several applications from both natural and manmade environments, ranging from gene networks in biology, to networked embedded systems in avionics and automotive controls, and to motion planning and control in robotics. Same as ENG ME 734 and ENG SE 734. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC745": {
            "id": "EC745",
            "name": "Nanomedicine",
            "prereqs": "",
            "content": "The use of nanoscience and technology for biomedical problems has spawned a   field of applications ranging from nanoparticles for imaging and therapeutics,   to biosensors for disease diagnostics. Nanomedicine is a rapidly growing field   that exploits the novel properties of nanoscale materials and techniques to   rapidly advance our understanding of human biology and the practice of medicine.   This course focuses on the fundamental properties, synthesis and   characterization of nanomaterials, coupled with their applications in   nanomedicine, including: micro- and nano-particles for drug delivery and   imaging, microfluidics for in vitro diagnostics, nanomaterials and platforms for   biological applications. The biomedical applications include cancer,   cardiovascular disease, and infectious diseases. Same as ENG BE 745. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC754": {
            "id": "EC754",
            "name": "Computer-Aided Verification and Synthesis",
            "prereqs": "Undergraduate Prerequisites: ENG EC 330; Familiarities of propositional logic, basic probability theory and basic graphic graph algorithms, and experience with one programming language (e.g., C++, Python) are assumed. An undergraduate course",
            "content": "This course will introduce the fundamental theory in computer-aided verification and synthesis for building provably dependable computer systems. The topics covered include logic specifications, modeling formalisms, verification techniques, and inductive synthesis strategies. A special focus of the course is on interplay between deductive reasoning (logical inference and constraint solving) and inductive inference (learning from data). We will also survey applications of these techniques to a wide range of problems in hardware, software, cyber-physical systems, robotics, and biology.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC762": {
            "id": "EC762",
            "name": "Quantum Optics",
            "prereqs": "Undergraduate Prerequisites: ENG EC 560; or equivalent, or consent of instructor.",
            "content": "Review of the postulates of quantum mechanics. Quantization of the electromagnetic field. Coherent, thermal, squeezed, and entangled states, and their associated photon statistics. Interaction of light with matter. Spontaneous and stimulated transitions. Theory of optical detection. Quantum theory of the laser. Interaction of light with two-level atoms, including photon echo and self-induced transparency. Quantum theory of parametric interactions.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC763": {
            "id": "EC763",
            "name": "Nonlinear and Ultrafast Optics",
            "prereqs": "Undergraduate Prerequisites: ENG EC 560.",
            "content": "Tensor theory of linear anisotropic optical media. Second- and third-order nonlinear optics. Three-wave mixing and parametric interaction devices, including second-harmonic generation and parametric amplifiers and oscillators. Four-wave mixing and phase conjugation optics. Electro-optics and photo-refractive optics. Generation, compression, and detection of ultra short optical pulses. Femtosecond optics. Pulse propagation in dispersive linear media. Optical solitons.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC765": {
            "id": "EC765",
            "name": "Biomedical Optics and Biophotonics",
            "prereqs": "",
            "content": "This course surveys the applications of optical science and engineering to a variety of biomedical problems, with emphasis on optical and photonics technologies that enable real, minimally-invasive clinical applications. The course teaches only those aspects of biology itself that are necessary to understand the purpose of the application. The first weeks introduce the optical properties of tissue, and following lectures cover a range of topics in three general areas: 1) Optical spectroscopy applied to diagnosis of cancer and other tissue diseases; 2) Photon migration and optical imaging of subsurface structures in tissue; and 3) Laser-tissue interactions and other applications of light for therapeutic purposes. In addition to formal lectures, recent publications from the literature will be selected as illustrative of various topical areas, and for each publication one student will be assigned to prepare an informal presentation (with overhead slides or PowerPoint) reviewing for the class the underlying principles of that paper and outlining the research results. Same as ENGBE765; students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC770": {
            "id": "EC770",
            "name": "Guided-wave Optoelectronics",
            "prereqs": "Undergraduate Prerequisites: ENG EC 560 or ENG EC 568.",
            "content": "Discussion of physics and engineering aspects of integrated optics and optoelectronic devices. Semiconductor waveguides, lasers, and photodetectors. Layered semiconductor structures, quantum wells, and superlattices. QW detectors, emitters, and modulators. OEICs. Photonic switching.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC771": {
            "id": "EC771",
            "name": "Physics of Compound Semiconductor Devices",
            "prereqs": "Undergraduate Prerequisites: ENG EC 574 or ENG EC 575 or CAS PY 543.",
            "content": "Physics of present-day compound devices, and emerging devices based on quantum mechanical phenomena. MESFETs, Transferred Electron Devices, avalanche diodes, photodetectors, and light emitters. Quantum mechanical devices based on low dimensionality confinement through the formation of heterojunctions, quantum wells, and superlattices. High electron mobility transistors, resonant tunneling diodes, quantum detectors, and lasers. Materials growth and characterization are integral to the course.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC772": {
            "id": "EC772",
            "name": "VLSI Graduate Design Project",
            "prereqs": "Undergraduate Prerequisites: ENG EC 571; consent of instructor",
            "content": "EC772 is a project-oriented course that demonstrates the use of high-level   design techniques.  There are lectures, milestone presentations, and a final   presentation.  The lectures, interleaved with tutorials showing the utilization   of Verilog, the Cadence RTL compiler, and Silicon Encounter, define the general   design flow.  Additional design issues are also elaborated in the form of   classroom lectures, which take up a fraction of the course class time. Student   groups of 2-5 define their own projects, which are scrutinized by the entire   class as to difficulty and possibility of success.   Milestones entail both oral   (presented in class times) and written components.  Typically, by the time of   the final presentation, the milestone documents can be simply, with test results   (not necessarily simple), are combined to demonstrate the veracity of the final   chip design.  Pay special attention to prerequisites.   Verilog is at the heart   of almost everything.  EC311 and EC413 or equivalent courses can provide the   minimal Verilog proficiency for LEAP students.  These courses do not qualify for   grad student credit, so EC551 (Verilog: may be co-req) or equivalent Verilog  skill is  necessary.   EC571 VLSI Design or strong equivalent proficiency in  digital  circuits at the transistor level is also essential.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC773": {
            "id": "EC773",
            "name": "Advanced Optical Microscopy and Biological Imaging",
            "prereqs": "Graduate Prerequisites: ENG EC 401 or ENG BE 401; Preferably a background in optics of photonics (ENG EC560 or equivalent or permission by instructor.",
            "content": "This course will present a rigorous and detailed overview of the theory of optical microscopy starting from basic notions in light propagation and covering advanced concepts in imaging theory such as Fourier optics and partial coherence. Topics will include basic geometric optics, photometry, diffraction, optical transfer functions, phase contrast microscopy, 3D imaging theory, basic scattering and fluorescence theory, imaging in turbid media, confocal microscopy, optical coherence tomography (OCT), holographic microscopy, fluorescence correlation spectroscopy (FCS), fluorescence resonant energy transfer (FRET), and nonlinear-optics based techniques such as two-photon excited fluorescence (TPEF) and second-harmonic generation (SHG) microscopy. Biological applications such as calcium and membrane-potential imaging will be discussed. A background in optics is preferable. A background in signals and analysis is indispensable. In particular, the student should be comfortable with Fourier transforms, complex analysis, and transfer functions. Same as ENG BE 773.  Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC774": {
            "id": "EC774",
            "name": "Semiconductor Quantum Structures and Photonic Devices",
            "prereqs": "Undergraduate Prerequisites: ENG EC 574; or equivalent",
            "content": "Optical properties of semiconductors: interband optical transitions; excitons.  Low-dimensional structures: quantum wells, superlattices, quantum wires, quantum dots, and their optical properties; intersubband transitions.  Lasers: double-heterojunction, quantum-well, quantum-dot, and quantum-cascade lasers; high-speed laser dynamics.  Electro-optical properties of bulk and low-dimensional semiconductors; electroabsorption modulators.  Detectors: photoconductors and photodiodes; quantum-well infrared photodetectors. Same as ENG MS 774. Students may not receive credit for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC777": {
            "id": "EC777",
            "name": "Nanostructure Optics",
            "prereqs": "Undergraduate Prerequisites: ENG EC 471 or ENG EC 562 or ENG EC 565 or ENG EC 574.",
            "content": "Discussion of the fundamental physical aspects and device applications of  optical fields confined and generated in nanoscale environments. Review of  classical electrodynamics and angular spectrum representation of optical fields,  classical and quantum models for light-matter interaction, light emission from  semiconductor quantum dots and wires, surface-plasmon polaritons and sub- wavelength light transport/localization in metal nanostructures, slot waveguide  structures, surface-enhanced Raman scattering (SERS) and SERS-based sensors,  light scattering in complex photonic structures such as: metal-dielectric  photonic crystals, fractal structrures, random lasers.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC782": {
            "id": "EC782",
            "name": "RF/Analog IC Design - Advanced Applications",
            "prereqs": "Undergraduate Prerequisites: ENG EC 580 and ENG EC 582; or permission of the instructor.",
            "content": "Selected topics in advanced RF/Analog integrated circuit design based on high frequency BiCMOS technology.  Topics to be covered include oversampling (Sigma Delta) A/D converters, RF phase-locked loops, low voltage RF frequency synthesizers, printed circuit board design for RF applications, antennas and signal propagation, PCB filters, and other mixed-signal topics.  The course will utilize selected readings from the technical literature, as well as a number of RF measurement and RF design lab assignments.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC801": {
            "id": "EC801",
            "name": "Teaching Practicum I",
            "prereqs": "",
            "content": "PhD Requirement. Assist faculty by performing teaching or teaching-related duties, such as preparing and teaching labs and discussion sections, developing teaching materials, assisting with homework preparation and grading, proctoring exams,  grading exams or papers.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC802": {
            "id": "EC802",
            "name": "Teaching Practicum II",
            "prereqs": "",
            "content": "PhD requirement. Assist faculty by performing teaching or teaching-related duties, such as preparing and teaching labs and discussion sections, developing teaching materials, assisting with homework preparation and grading, proctoring exams,  grading exams or papers.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC810": {
            "id": "EC810",
            "name": "PhD Internship in Electrical and Computer Engineering",
            "prereqs": "Graduate Prerequisites: Permission of advisor and an approved internship offer; at least two complete semesters in the EC PhD program.",
            "content": "This course is intended for students who want to do an internship in the US as part of their graduate program and would like to have internship credit listed on their transcript. International Students need to use their CPT for this course.   Prerequisites: 2 full semesters in ECE",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC890": {
            "id": "EC890",
            "name": "PhD Seminar 1",
            "prereqs": "",
            "content": "ECE PhD First year requirement students will participate in seminars and skill development workshops on current topics in electrical and computer engineering. Students are expected to participate in discussions and read assigned material.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC891": {
            "id": "EC891",
            "name": "PhD Seminar 2",
            "prereqs": "",
            "content": "ECE PhD First year requirement students will participate in  seminars and skill development workshops on current topics in electrical and computer engineering. Students are expected to participate in discussions and read assigned material.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC892": {
            "id": "EC892",
            "name": "Seminar",
            "prereqs": "",
            "content": "A weekly two-hour seminar on recent research topics in the area of electro-physics, including solid state materials and devices, photonics, electromagnetics, computers in physics, and other related areas. Speakers include faculty and graduate students in the area.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC900": {
            "id": "EC900",
            "name": "PhD Research",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: Graduate standing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC951": {
            "id": "EC951",
            "name": "Independent Study",
            "prereqs": "",
            "content": "By petition only. Under faculty supervision, graduate students may study subjects not covered in a regularly scheduled course. A final report and/or written examination is required. Variable cr.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC952": {
            "id": "EC952",
            "name": "Directed Group Project",
            "prereqs": "",
            "content": "A semester long engineering project with significant graduate-level design and      implementation elements is carried out by a team of 1 to 4 graduate students      under the supervision of an ECE faculty member. Required deliverables include a      written proposal, an end-of-semester project report, and an end-of-semester      oral/poster presentation. The project proposal must be approved by the faculty      supervisor before project team members may register for this course.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC953": {
            "id": "EC953",
            "name": "MS Project",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: Graduate Standing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC954": {
            "id": "EC954",
            "name": "MS Thesis",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: Graduate standing.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEC991": {
            "id": "EC991",
            "name": "PhD Dissertation",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: Graduate standing.",
            "prof": [],
            "reviews": []
        }
    }
]