[
    {
        "CASMA107": {
            "id": "MA107",
            "name": "Mathematical Reasoning in the Elementary Grades",
            "prereqs": "",
            "content": "Mathematical Reasoning in the Elementary Grades: Number Systems  Required  for undergraduates seeking licensure in elementary education, early  childhood education,special education, or deaf studies. Focuses on number  systems, whole number, decimal and fraction concepts and operations, and  number theory. Non-Wheelock students by signed permission only. Does not  satisfy CAS Divisional Studies or Math/Stat major. 4 cr. 1st sem. Effective  Fall 2019, this course fulfills a single unit in each of the following BU  Hub areas: Quantitative Reasoning I, Oral and/or Signed Communication,  Teamwork/Collaboration.  BU Hub   Learn More  Quantitative Reasoning IOral and/or Signed CommunicationTeamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA108": {
            "id": "MA108",
            "name": "Mathematical Reasoning in the Elementary Grades",
            "prereqs": "Undergraduate Prerequisites: CAS MA 107 or SED ME 503.",
            "content": "Required for undergraduates seeking licensure in elementary education, special  education, or deaf studies. Focuses on topics in algebra, geometry,  measurement, and statistics.  Non-SED students by signed permission only. Does  not satisfy CAS Divisional Studies or Math/Stat major. Effective Fall 2019,  this course fulfills a single unit in each of the following BU Hub areas:  Quantitative Reasoning II, Oral and/or Signed Communication,  Teamwork/Collaboration.  BU Hub   Learn More  Quantitative Reasoning IIOral and/or Signed CommunicationTeamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA111": {
            "id": "MA111",
            "name": "Mathematical Explorations",
            "prereqs": "",
            "content": "Students explore challenging mathematics problems chosen from an array of  topics that can  be solved in multiple ways. Includes making, testing, and  modifying conjectures; constructing  proofs; posing new problems; extensive  classroom interaction; reflective and other writing.  Effective Fall 2019, this course fulfills a  single unit in each of the following BU Hub areas:  Quantitative Reasoning  II, Oral and/or Signed Communication, Creativity/Innovation.  BU Hub   Learn More  Quantitative Reasoning IIOral and/or Signed CommunicationCreativity/Innovation",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA113": {
            "id": "MA113",
            "name": "Elementary Statistics",
            "prereqs": "",
            "content": "CAS MA 113 may not be taken for credit by any student who has completed any  MA   course  numbered 300 or higher. Students may receive credit for not more  than  one of the  following  courses: CAS MA 113, MA 115, or MA 213. Basic  concepts of  estimation and  tests of  hypotheses, ideas from probability;   one-, two-, and  multiple-sample problems.  Applications  will be in social  sciences  and  students will be able to understand the basics  of  using a  sample to   predict uncertainty. Carries MCS divisional credit in CAS. Effective  Fall 2018,  this course fulfills a  single  unit in the  following BU Hub area: Quantitative   Reasoning II.  Effective Fall 2020,  this course fulfills a single unit in each of the following  BU Hub areas:  Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA115": {
            "id": "MA115",
            "name": "Statistics I",
            "prereqs": "",
            "content": "CAS MA 115 may not be taken for credit by any student who has completed any  MA  course  numbered 300 or higher. Students may receive credit for not more  than  one of the following  courses: CAS MA 113, MA 115, or MA 213.  Numerical and  graphical summaries of univariate and  bivariate data. Basic   probability,  random variables, binomial distribution, normal distribution.   One- sample  statistical inference for normal means and binomial  probabilities.  Primarily  for  students in the social sciences with limited  mathematics  preparation.  Carries MCS divisional  credit in CAS. Effective  Fall 2018, this course  fulfills a single  unit in the following BU Hub  area: Quantitative  Reasoning  II. Effective Fall 2020, this course fulfills  a single unit in each of the following BU Hub areas: Quantitative Reasoning  II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA116": {
            "id": "MA116",
            "name": "Statistics II",
            "prereqs": "Undergraduate Prerequisites: CAS MA 115; or equivalent.",
            "content": "CAS MA 116 may not be taken for credit by any student who has completed any  MA  course  numbered 300 or higher. Students may receive credit for not more  than  one of the following  courses: CAS MA 116, MA 214, or MA 614. This  course  introduces basic statistical modeling  techniques. One- or two-  sample  inference for unknown means, proportions and variances,  categorical  data   analysis, introduction to design of experiments and analysis of  variance,    analysis of simple and multiple linear regression models, non- parametric   methods. Carries  MCS divisional credit in CAS. Effective Fall  2018, this  course fulfills a single  unit in the following BU Hub area:   Quantitative  Reasoning II. Effective Fall 2020, this course fulfills a  single unit in each of the following BU Hub areas: Quantitative Reasoning  II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA119": {
            "id": "MA119",
            "name": "Applied Mathematics for Personal Finance",
            "prereqs": "",
            "content": "Applications of mathematics for personal financial decision-making. Systems  of   equations,   exponential functions, logarithms, probability,  descriptive   statistics, and numerical simulation,   for modeling saving,  borrowing,   inflation, purchasing power, taxation, government benefits,  risk   management,   insurance, annuities, and investments. Carries MCS  divisional credit in CAS.   Effective Fall 2018, this  course fulfills a  single unit in each of  the  following BU Hub areas:  Social Inquiry I,  Quantitative  Reasoning I. This  course also fulfills the  learning outcomes  for Life Skills.  Effective Fall 2020, this course fulfills a single unit in  each of the following BU Hub areas: Quantitative Reasoning I, Social Inquiry  I, Critical Thinking.  BU Hub   Learn More  Social Inquiry IQuantitative Reasoning ICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA121": {
            "id": "MA121",
            "name": "Calculus for the Life and Social Sciences I",
            "prereqs": "",
            "content": "Students may receive credit for not more than one of the following courses:  CAS  MA 121 or  CAS MA 123. Differentiation and integration of functions of  one  variable. Same topics as CAS   MA 123, but with less emphasis on  mathematical  generality and more on  applications.  Especially suitable for  students  concentrating in the biological  and social sciences. Carries  MCS  Divisional  credit in CAS. Effective Fall 2018, this course fulfills a  single unit in the  following BU Hub area:  Quantitative Reasoning II.   Effective Fall 2020, this course fulfills a single unit in each of the  following BU Hub areas: Quantitative Reasoning II, Social Inquiry II,  Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IISocial Inquiry IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA122": {
            "id": "MA122",
            "name": "Calculus for the Life and Social Sciences II",
            "prereqs": "Undergraduate Prerequisites: CAS MA 121 or CAS MA 123.",
            "content": "Students may receive credit for not more than one of the following courses:  CAS MA 122,  MA 124, or MA 129. Continuation of CAS MA 121. Review of    univariate calculus, calculus of  the elementary transcendental functions,    elementary differential equations, elementary  multivariate calculus.  Applications to exponential growth, optimization, equilibrium, and  dynamic    modeling problems. Carries MCS divisional credit in CAS. Effective Fall  2018,   this course fulfills a  single unit in the following BU Hub area:  Quantitative  Reasoning II.  Effective Fall 2020, this course fulfills a  single unit in each of the following BU Hub areas: Quantitative Reasoning  II, Social Inquiry II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IISocial Inquiry IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA123": {
            "id": "MA123",
            "name": "Calculus I",
            "prereqs": "",
            "content": "Students may receive credit for not more than one of the following courses: CAS   MA 121 or  CAS MA 123. Limits; derivatives; differentiation of algebraic and   transcendental functions.   Applications to maxima, minima, and convexity of   functions. The definite  integral; the  fundamental theorem of integral   calculus. Carries MCS divisional  credit in CAS. Effective Fall 2018, this   course  fulfills a single unit in the following BU Hub area: Quantitative   Reasoning II.  Effective Fall 2020, this course fulfills a single unit in each  of the following BU Hub areas: Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA124": {
            "id": "MA124",
            "name": "Calculus II",
            "prereqs": "Undergraduate Prerequisites: CAS MA 121 or CAS MA 123.",
            "content": "Students may receive credit for not more than one of the following courses:  CAS MA 122,  MA 124, or MA 129. Logarithmic, exponential, and  trigonometric   functions. Sequences  and series; Taylor's series with the  remainder. Methods of   integration. Calculus I and II  together constitute  an introduction to calculus   of a function of a single real variable.   Carries MCS divisional credit in CAS.   Effective Fall 2018, this course  fulfills a single unit in  the following BU Hub  area: Quantitative   Reasoning II.  Effective Fall 2020, this course  fulfills a single unit in  each of the following BU Hub areas: Quantitative Reasoning II,  Scientific  Inquiry II, Critical Thinking.  BU Hub   Learn More  Scientific Inquiry IIQuantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA193": {
            "id": "MA193",
            "name": "Discrete Mathematics for Engineering",
            "prereqs": "",
            "content": "Propositional logic, set theory, relations, combinatorics, graphs. Topics are  treated with particular emphasis on applications to the engineering  discipline. (Cannot be taken for credit in addition to CAS MA 293.)  Effective  Fall 2020, this course fulfills a single unit in the following BU Hub area:  Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA213": {
            "id": "MA213",
            "name": "Basic Statistics and Probability",
            "prereqs": "Undergraduate Prerequisites: good background in high school algebra.",
            "content": "Students may receive credit for not more than one of the following courses:  CAS  MA 113, MA  115, or MA 213. Elementary treatment of probability  densities,  means, variances, correlation,   independence, the central limit  theorem,  confidence intervals, and p-values.  Students will be  able to  answer questions  such as how can a pollster use a  sample to predict the  uncertainty of  an  election? Carries MCS divisional credit  in CAS.  Effective Fall 2018, this  course fulfills a single unit in each of the   following BU Hub  areas:  Quantitative Reasoning II, Teamwork/Collaboration.   Effective Fall 2020, this course fulfills a single unit in each of the  following BU Hub areas: Quantitative Reasoning II, Critical Thinking,  Teamwork/Collaboration.  BU Hub   Learn More  Quantitative Reasoning IICritical ThinkingTeamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA214": {
            "id": "MA214",
            "name": "Applied Statistics",
            "prereqs": "Undergraduate Prerequisites: CAS MA 213; or consent of instructor.",
            "content": "Students may receive credit for not more than one of the following courses:  CAS  MA 116, MA  214, or MA 614. Inference about proportions, goodness of  fit,  student's t-distribution,  tests for  normality; two-sample  comparisons,  regression and correlation, tests for linearity and outliers,   residual  analysis, contingency tables, analysis of variance. Carries MCS  divisional  credit in CAS.  Effective Fall 2018, this course  fulfills a  single unit in  each of the following BU Hub areas: Quantitative  Reasoning   II,  Teamwork/Collaboration. Effective Fall 2020, this course fulfills a  single unit in each of the following BU Hub areas: Quantitative Reasoning  II, Critical Thinking, Teamwork/Collaboration.  BU Hub   Learn More  Quantitative Reasoning IICritical ThinkingTeamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA225": {
            "id": "MA225",
            "name": "Multivariate Calculus",
            "prereqs": "Undergraduate Prerequisites: CAS MA 124 or CAS MA 129.",
            "content": "Vectors, lines, planes. Multiple integration, cylindrical and spherical    coordinates. Partial derivatives, directional derivatives, scalar and vector    fields, the gradient, potentials, approximation, multivariate minimization,    Stokes's and related theorems. (Cannot be taken for credit in addition to  CAS   MA 230.) Effective Fall 2018, this course fulfills a single unit in  the  following BU Hub area:  Quantitative Reasoning II.  Effective Fall  2020, this course fulfills a single unit in each of the following BU Hub  areas: Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA226": {
            "id": "MA226",
            "name": "Differential Equations",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "content": "First-order linear and separable equations. Second-order equations and  first-order systems. Linear equations and linearization. Numerical and  qualitative analysis. Laplace transforms. Applications and modeling of real  phenomena throughout. (Cannot be taken for credit in addition to CAS MA  231.) Effective Fall 2020, this course fulfills a single unit in the  following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA230": {
            "id": "MA230",
            "name": "Honors-Level Vector Calculus",
            "prereqs": "Undergraduate Prerequisites: CAS MA 124 or CAS MA 129.",
            "content": "Linear algebra: linear transformations and matrices, inner products, cross  products. Differentiation: tangent spaces, directional derivatives,  gradients, vector fields and flow, divergence, curl. Integration: multiple  integrals, line integrals, Green's theorem, surface integrals, Stokes's  theorem, the divergence theorem.  (Cannot be taken for credit in addition to  CAS MA 225.)  Effective Fall 2020, this course fulfills a single unit in the  following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA231": {
            "id": "MA231",
            "name": "Honors-Level Differential Equations",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "content": "Ordinary differential equations with applications to mechanics, biology, and  physics. First- and second-order equations, linear and nonlinear systems,  Sturm-Louisville problems, vibrating strings, special functions, power  series solutions, regular singular points, Laplace transforms, calculus of  variations, isoperimetric problems, and Hamilton's principle. (Cannot be  taken for credit in addition to CAS MA 226.)  Effective Fall 2020, this  course fulfills a single unit in the following BU Hub area: Critical  Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA242": {
            "id": "MA242",
            "name": "Linear Algebra",
            "prereqs": "Undergraduate Corequisites: CAS MA 122 or CAS MA 124 or CAS MA 129.",
            "content": "Cannot be taken for credit in addition to CAS MA 442 or ENG EK 103. Matrix  algebra, solution   of linear systems, determinants, Gaussian  elimination,  fundamental theory, row-echelon form.   Vector spaces, bases, norms.  Computer methods. Eigenvalues and eigenvectors, canonical    decomposition.  Applications. Effective Fall 2019, this course fulfills a single unit in the    following BU Hub area: Quantitative Reasoning II.  Effective Fall 2020, this  course fulfills a single unit in each of the following BU Hub areas:  Quantitative Reasoning II, Critical Thinking.  BU Hub   Learn More  Quantitative Reasoning IICritical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA293": {
            "id": "MA293",
            "name": "Discrete Mathematics",
            "prereqs": "",
            "content": "Propositional logic, set theory. Elementary probability theory. Number theory.  Combinatorics with applications. Effective Fall 2020, this course fulfills a  single unit in the following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA294": {
            "id": "MA294",
            "name": "Applied Abstract Algebra",
            "prereqs": "Undergraduate Prerequisites: CAS MA 293; or consent of instructor.",
            "content": "Abstract algebra and its applications to combinatorics. A first exposure to  groups, rings, and fields via  significant combinatorial applications.  Students who have already received credit for MA 541 or MA 542  may not  subsequently receive credit for MA 294. Effective Fall 2020, this course  fulfills a single unit in the following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA301": {
            "id": "MA301",
            "name": "Writing in Mathematics",
            "prereqs": "Undergraduate Prerequisites: First Year Writing Seminar (WR120).",
            "content": "Prerequisite for this course: First Year Writing Seminar (WR120). Writing in   mathematics is distinctive for at least two  reasons: i) in addition to written   language, mathematical writing involves numbers, symbols, and images; and ii)    mathematicians write not only to communicate their work, but more perhaps   importantly to clarify and refine their own  thinking. In this class, we explore   how writing is used to both communicate and facilitate mathematics by   participating  in the process of writing across a range of discipline-specific   genres, including proof writing and expository writing, for  distinct audiences   such as peer mathematicians and the public. In order to receive credit for MA 301 a student must 1)  have not yet received credit for any MA courses numbered 500 and above OR 2) have already received credit for MA  courses numbered 500 but received no grades of A- or higher in any of them. Effective Spring 2023, this course   fulfills a  single unit in each of the following BU Hub areas: Writing-Intensive   Course.  BU Hub   Learn More  Writing-Intensive Course",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA341": {
            "id": "MA341",
            "name": "Introduction to Number Theory",
            "prereqs": "Undergraduate Prerequisites: CAS MA 242; or consent of instructor.",
            "content": "Study of integers and basic results of number theory. Topics include Linear  Diophantine equations, prime numbers and factorization, congruences, and  quadratic reciprocity.  Effective Fall 2020, this course fulfills a single  unit in the following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA401": {
            "id": "MA401",
            "name": "Senior Independent Work",
            "prereqs": "Undergraduate Prerequisites: approval by the Director of Undergraduate Studies.",
            "content": "This course is the first in a two-semester sequence during which the student  conducts a substantial research project under the supervision of a faculty  advisor. Effective Fall 2023, this course fulfills a single unit in the following  BU HUB areas: Research and Information Literacy.  BU Hub   Learn More  Research and Information Literacy",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA402": {
            "id": "MA402",
            "name": "Senior Independent Work",
            "prereqs": "Undergraduate Prerequisites: approval by the Director of Undergraduate Studies.",
            "content": "This course is the second in a two-semester sequence during which the student conducts a substantial research project under the supervision of a faculty advisor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA411": {
            "id": "MA411",
            "name": "Advanced Calculus",
            "prereqs": "Undergraduate Prerequisites:  CAS MA 225 or CAS MA 230 and CAS MA 242 or CAS MA 442.",
            "content": "Extends concepts and techniques of calculus and develops further applications. Topics include higher dimensional calculus, applications of vector analysis, uniform convergence of series, complex series, improper integrals, gamma and beta functions, Stirling's formula, Fourier series and transform.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA412": {
            "id": "MA412",
            "name": "Complex Variables",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "content": "Basic concepts, results, and applications of complex analysis. Emphasis on computation and applications. Complex plane and functions, differentiability, Cauchy-Riemann conditions, contour integrals, Cauchy formulas, complex series, residue calculus, applications. Extends the concepts of the calculus to the complex setting.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA415": {
            "id": "MA415",
            "name": "Data Science in R",
            "prereqs": "Undergraduate Prerequisites: CAS CS 111; (or equivalent), and at least one course in statistics.",
            "content": "Introduction to R, the computer language written by and for statisticians.  Emphasis on data exploration, statistical analysis, problem solving,  reproducibility, and multimedia delivery.  Effective Fall 2020, this course  fulfills a single unit in the following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA416": {
            "id": "MA416",
            "name": "Analysis of Variance",
            "prereqs": "Undergraduate Prerequisites: CAS MA 116 or CAS MA 214; or equivalent.",
            "content": "Fundamental concepts and analytical skills in analysis of variance, including  crossed and nested designs, as well as fixed- and random- effect models. Trend  analysis for repeated measures, expected mean squares, and non-parametric  techniques. SAS is used throughout the course. Effective Fall 2020, this  course fulfills a single unit in the following BU Hub area: Critical Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA433": {
            "id": "MA433",
            "name": "Graph Theory",
            "prereqs": "Undergraduate Prerequisites: CAS MA 242 and CAS MA 293; or consent of instructor.",
            "content": "Graph Theory can be used to generalize the concept of what it means for  geometric objects to be connected and describe complex systems. Using vertices  to represent objects and edges to represent which objects are adjacent to each  other, students will be able to analyze the system as a whole. Students can  study which geometrical objects can be placed on a plane, sphere, torus, etc. as  well as generalize the concept of connected to more abstract settings. Students  will explore these geometric aspects as well as analyze various algorithms and  open problems in Graph Theory.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA442": {
            "id": "MA442",
            "name": "Honors Level Linear Algebra",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "content": "A thorough development of the fundamentals of linear algebra. Systems of  linear equations; matrices, linear transformations, duality; determinants,  characteristic and minimal polynomials; diagonalization and normal forms of  linear transformations; inner products, unitary and self-adjoint operators,  and spectral theory. Applications to physics, probability, and statistics.  (Cannot be taken for credit in addition to CAS MA 242.) Effective Fall 2020,  this course fulfills a single unit in the following BU Hub area: Critical  Thinking.  BU Hub   Learn More  Critical Thinking",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA491": {
            "id": "MA491",
            "name": "Directed Study",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: consent of instructor and application made through the Mathematics Department.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA492": {
            "id": "MA492",
            "name": "Directed Study",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: consent of instructor and application made through the Mathematics Department.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA505": {
            "id": "MA505",
            "name": "History of Mathematics",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230; and (CASMA242 or CASMA442); or consent of instructor.",
            "content": "The development of mathematics from Antiquity through the 18th Century.   Assuming background in modern mathematics, its roots are systematically   pursued in terms of modern techniques, structures, and results. Providing  the  emergence of mathematical concepts and procedures, a coherent, unifying  view  of number, geometry, algebra, calculus, and mathematical analysis is   presented. Effective Fall 2018, this course fulfills a single unit in the  following BU Hub area:  Historical Consciousness.  BU Hub   Learn More  Historical Consciousness",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA511": {
            "id": "MA511",
            "name": "Introduction to Analysis I",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA512": {
            "id": "MA512",
            "name": "Introduction to Analysis II",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 511.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA528": {
            "id": "MA528",
            "name": "Introduction to Modern Geometry",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA531": {
            "id": "MA531",
            "name": "Mathematical Logic",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 293; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA532": {
            "id": "MA532",
            "name": "Foundations of Mathematics",
            "prereqs": "Undergraduate Prerequisites: CAS MA 531.",
            "content": "Axiomatic set theory as a foundation for mathematics and as a field of mathematics: Axiom of Choice, the  Continuum Hypothesis, and consistency results. Also offered as CAS PH 461.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA539": {
            "id": "MA539",
            "name": "Methods of Scientific Computing",
            "prereqs": "Undergraduate Prerequisites:  CAS MA 225 or CAS MA 230 ; CAS MA 226 or CAS MA 231 ; CAS MA 242 orCAS MA 442 ; CAS CS 330; or consent of instructor.",
            "content": "(Meets with CAS CS 539.) An introduction to topics including computational linear algebra, solutions of linear equations, numerical integration and solution of differential equations, finite element methods, and methods of stochastic simulation (i.e., Monte Carlo methods).",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA541": {
            "id": "MA541",
            "name": "Modern Algebra 1",
            "prereqs": "Undergraduate Prerequisites: CAS MA 242 or CAS MA 442.",
            "content": "Basic properties of groups, Sylow theorems, basic properties of rings and ideals, Euclidean rings, polynomial rings.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA542": {
            "id": "MA542",
            "name": "Modern Algebra II",
            "prereqs": "Undergraduate Prerequisites: CAS MA 541; or consent of instructor.",
            "content": "Vector spaces and modules, Galois theory, linear transformations and matrices, canonical forms, bilinear and quadratic forms.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA547": {
            "id": "MA547",
            "name": "Topics in Number Theory",
            "prereqs": "",
            "content": "Graduate Prerequisites: CAS MA 242; and consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA548": {
            "id": "MA548",
            "name": "Problem Solving in Number Theory",
            "prereqs": "Graduate Corequisites: CAS MA 547.",
            "content": "Mathematical heuristics, including good use of language and symbolism, and techniques of exploration  and discovery. Through intensive work on a large assortment of unusually challenging problems in number  theory students practice the art of mathematical discovery--numerical exploration, formulation and  critique of conjectures, and techniques of proof and generalization. This course is offered only during  Summer Term.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA555": {
            "id": "MA555",
            "name": "Numerical Analysis I",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA556": {
            "id": "MA556",
            "name": "Numerical Analysis II",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 555 and CAS MA 242 or CAS MA 442; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA561": {
            "id": "MA561",
            "name": "Methods of Applied Mathematics I",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 226 or CAS MA 231.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA562": {
            "id": "MA562",
            "name": "Methods of Applied Mathematics II",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 561.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA563": {
            "id": "MA563",
            "name": "Introduction to Differential Geometry",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230; and (CASMA226 OR CASMA231) and (CASMA242 or CASMA442); or consent of instructor.",
            "content": "Study of local properties of curves and surfaces in the three-dimensional Euclidean space; curvature, torsion, Frenet equations, tangent and normal planes; first and second fundamental form; developable surfaces, principal, mean and Gaussian curvature; vector fields, covariant differentiation, geodesics, surfaces of constant curvature.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA564": {
            "id": "MA564",
            "name": "Introduction to Topology",
            "prereqs": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230;  and (CASMA411 or CASMA511); or consent of instructor.",
            "content": "Introduction to point set and algebraic topology. Topological spaces and continuity. Compactness and connectedness. Metrizable topological spaces. Product topology and Tychonoff's theorem. The fundamental group and van Kampen's theorem. Covering spaces and the universal cover.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA565": {
            "id": "MA565",
            "name": "Mathematical Models in the Life Sciences",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 226 or CAS MA 231.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA568": {
            "id": "MA568",
            "name": "Statistical Analysis of Point Process Data",
            "prereqs": "Undergraduate Prerequisites: CAS MA 213 and CAS MA 214; or consent of instructor.",
            "content": "Introduces the theory of point processes and develops practical problem-solving skills to construct models, assess goodness-of-fit, and perform estimation from point process data. Applications to neural data, earthquake analysis, financial modeling, and queuing theory.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA569": {
            "id": "MA569",
            "name": "Optimization Methods of Operations Research",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230; , CASMA242 OR CASMA442",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA570": {
            "id": "MA570",
            "name": "Stochastic Methods of Operations Research",
            "prereqs": "",
            "content": "Undergraduate Prerequisites:  CAS MA 225 or CAS MA 230 and CAS MA 242 or CAS MA 442.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA573": {
            "id": "MA573",
            "name": "Qualitative Theory of Ordinary Differential Equations",
            "prereqs": "Undergraduate Prerequisites: (CASMA226 OR CASMA231) & (CASMA242 OR CASMA442)",
            "content": "Eigenvalues, eigenvectors, Jordan normal forms. Linear systems of differential equations, Phase portrait, Hamiltonian systems, stability theory. Applications to systems arising in mechanics, economics, ecology, electrical circuit theory, etc.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA575": {
            "id": "MA575",
            "name": "Linear Models",
            "prereqs": "Undergraduate Prerequisites: CAS MA 214 ; CAS MA 242 ; CAS MA 581; or consent of instructor.",
            "content": "Post-introductory course on linear models. Topics to be covered include  simple and multiple  linear regression, regression with polynomials or  factors, analysis of variance, weighted and  generalized least squares,  transformations, regression diagnostics, variable selection, and  extensions  of linear models. Effective Fall 2019, this course fulfills a single unit in the following  BU Hub  area: Quantitative Reasoning II, Teamwork/Collaboration.  BU Hub   Learn More  Quantitative Reasoning IITeamwork/Collaboration",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA576": {
            "id": "MA576",
            "name": "Generalized Linear Models",
            "prereqs": "Undergraduate Prerequisites: CAS MA 575; or consent of instructor.",
            "content": "Covers topics in linear models beyond MA 575: generalized linear models, analysis of binary and polytomous data, log-linear models, multivariate response models, non-linear models, graphical models, and relevant model selection techniques.  Additional topics in modern regression as time allows.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA577": {
            "id": "MA577",
            "name": "Mathematics of Financial Derivatives",
            "prereqs": "Undergraduate Prerequisites: CAS MA 581; or consent of instructor.",
            "content": "Develops the probabilistic tools used in finance and presents the methodologies that are used in the pricing of financial derivatives. No previous knowledge of finance is required.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA578": {
            "id": "MA578",
            "name": "Bayesian Statistics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 581 and CAS MA 582.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA579": {
            "id": "MA579",
            "name": "Numerical Methods for Biological Sciences",
            "prereqs": "Undergraduate Prerequisites: CAS MA 226 or CAS MA 231; or equivalent, and elementary knowledge of linear algebra.",
            "content": "Introduction to the use of numerical methods for studying mathematical models of biological systems. Emphasis on the development of these methods; understanding their accuracy, performance, and stability; and their application to the study of biological systems.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA581": {
            "id": "MA581",
            "name": "Probability",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 225 or CAS MA 230; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA582": {
            "id": "MA582",
            "name": "Mathematical Statistics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 581.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA583": {
            "id": "MA583",
            "name": "Introduction to Stochastic Processes",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 581; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA585": {
            "id": "MA585",
            "name": "Time Series and Forecasting",
            "prereqs": "Undergraduate Prerequisites: CAS MA 581; or consent of instructor.",
            "content": "Autocorrelation and partial autocorrelation functions; stationary and nonstationary processes; ARIMA and Seasonal ARIMA model identification, estimation, diagnostics, and forecasting. Modeling financial data via ARCH and GARCH models. Volatility estimation; additional topics, including long-range dependence and state-space models.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA586": {
            "id": "MA586",
            "name": "Stochastic Methods for Algorithms",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: First-Year Writing Seminar (e.g., WR 120); CAS CS111, CDS DS110, ENG EK125, or equivalent; CAS MA225, CAS CS235, CDS DS122, or equivalent; CAS MA242, CAS CS132, CDS DS121, or equivalent; CAS MA581, CA",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA588": {
            "id": "MA588",
            "name": "Nonparametric Statistics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 582; or equivalent, consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA589": {
            "id": "MA589",
            "name": "Computational Statistics",
            "prereqs": "Undergraduate Prerequisites: CAS MA 213;  AND CASMA242 (OR CAS MA 442), AND CASMA581; or equivalent with consent of instructor.",
            "content": "Topics from computational statistics that are relevant to modern statistical applications: random number  generation, sampling, Monte Carlo methods, computational inference, MCMC methods, graphical models,  data partitioning, and bootstrapping. Emphasis on developing solid conceptual understanding of the  methods through applications.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASMA592": {
            "id": "MA592",
            "name": "Introduction to Causal Inference",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 575; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    }
]