{
    "CASCS501": {
        "id": "CS501",
        "name": "Computer Science Practicum",
        "prereqs": "",
        "content": "Various applications of computer science that vary semester to semester. Please contact the  CAS Computer Science Department for detailed descriptions.",
        "prof": [],
        "reviews": []
    },
    "CASCS505": {
        "id": "CS505",
        "name": "Introduction to Natural Language Processing",
        "prereqs": "Undergraduate Prerequisites: CAS CS 365.",
        "content": "Natural language processing (NLP) is a field of AI which aims to equip computers with the  ability to intelligently process natural (human) language. This course explores statistical and  machine learning techniques for the automatic analysis of natural language data.",
        "prof": [],
        "reviews": []
    },
    "CASCS506": {
        "id": "CS506",
        "name": "Data Science Tools and Applications",
        "prereqs": "Undergraduate Prerequisites: CAS CS 108 or CAS CS 111; CAS CS 132 or CAS MA 242 or CAS MA 442. CASCS 112 is recommended.",
        "content": "Covers practical skills in working with data and introduces a wide range of  techniques that are   commonly used in the analysis of data, such as clustering,  classification, regression, and   network analysis. Emphasizes hands-on  application of methods via programming. Effective Fall  2019, this course  fulfills a single unit in each of the following BU Hub areas: Research and   Information Literacy, Teamwork/Collaboration.",
        "prof": [],
        "reviews": []
    },
    "CASCS511": {
        "id": "CS511",
        "name": "Formal Methods 1",
        "prereqs": "Undergraduate Prerequisites: CAS CS 320 or CAS CS 330 or CAS CS 350.",
        "content": "Introduction to formal specification, analysis, and verification of computer system behavior.    Topics include formal logical reasoning about computer programs and systems, automated and    semi-automated verification, and algorithmic methodologies for ascertaining that a software    system satisfies its formally specified properties. Cannot be taken for credit in addition to the   course with the same number formerly entitled \"Object-Oriented Software Principles.\"",
        "prof": [],
        "reviews": []
    },
    "CASCS516": {
        "id": "CS516",
        "name": "Software Foundations via Formal Languages",
        "prereqs": "Undergraduate Prerequisites: CAS CS 320 and CAS CS 330; or equivalent courses approved by the instructor.",
        "content": "Study of the hierarchy of formal languages with a focus on algorithms on the  formalisms. Experimentation with these algorithms using a computer toolset.  Applications of these algorithms to compiler construction, implementation of  finite-state control devices, and formal methods.",
        "prof": [],
        "reviews": []
    },
    "CASCS518": {
        "id": "CS518",
        "name": "Formal Tools for Software Validation",
        "prereqs": "Graduate Prerequisites: Bachelor's degree in computer science OR Bachelor's degree in computer engineering OR consent of instructor, AND working familiarity with at least one modern programming language.",
        "content": "Introduces various methodologies for formal specification, testing and   verification, to understand and eliminate bugs undermining system security. Two   general methodologies are considered: dynamic methodologies using property-based   testing and symbolic execution, and static methodologies involving program-based   formal verification techniques.",
        "prof": [],
        "reviews": []
    },
    "CASCS519": {
        "id": "CS519",
        "name": "Spark! Software Engineering X-Lab Practicum",
        "prereqs": "Undergraduate Prerequisites: CAS CS 411 or CDS DS 310; or equiv. experience in software development and consent of instructor.",
        "content": "Consent provided upon successful completion of pass/fail diagnostic test that  assesses student readiness to take the course. This course offers students in  computing disciplines the opportunity to apply their programming and system  development skills by working on real-world projects provided from partnering  organizations within and outside of BU, which are curated by Spark! The course  offers a range of project options where students can improve their technical  skills, while also gaining the soft skills necessary to deliver projects aligned  to the partner's goals. These include teamwork and communications skills and  software development processes. Effective Spring 2022, this course fulfills a  single unit in each of the following BU Hub areas: Ethical Reasoning, Oral  and/or Signed Communication, Teamwork/Collaboration.",
        "prof": [],
        "reviews": []
    },
    "CASCS523": {
        "id": "CS523",
        "name": "Deep Learning",
        "prereqs": "Undergraduate Prerequisites: CAS CS 542.",
        "content": "Mathematical and machine learning background for deep learning. Feed-forward  networks.,  Backpropagation. Training strategies for deep networks. Architectures  such as convolutional, recurrent, transformer networks. Deep reinforcement  learning. Deep unsupervised learning. Exposure to modern programming tools and  libraries. Other recent topics, time permitting.",
        "prof": [],
        "reviews": []
    },
    "CASCS525": {
        "id": "CS525",
        "name": "Compiler Design Theory",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CAS CS 320; , or consent of instructor.",
        "prof": [],
        "reviews": []
    },
    "CASCS528": {
        "id": "CS528",
        "name": "Cloud Computing",
        "prereqs": "Undergraduate Prerequisites: CAS CS 350 and CAS CS 460; or consent of instructor. CASCS455, CASCS552, and CASCS562 are recommended.",
        "content": "Fundamentals of cloud computing covering IaaS platforms, OpenStack, key Big Data platforms, and data center scale systems. Examines influential publications in cloud computing. Culminates in a group project supervised by a mentor from industry or academia.",
        "prof": [],
        "reviews": []
    },
    "CASCS530": {
        "id": "CS530",
        "name": "Advanced Algorithms",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CAS CS 330; or consent of instructor.",
        "prof": [],
        "reviews": []
    },
    "CASCS531": {
        "id": "CS531",
        "name": "Advanced Optimization Algorithms",
        "prereqs": "Undergraduate Prerequisites: CAS MA 123 & 124, or equivalent and CAS CS 132 or equivalent; or consent of instructor.",
        "content": "Optimization algorithms, highlighting the fruitful interactions between discrete and continuous.  Intended audience is advanced master students and doctoral students. Topics include gradient  descent algorithms, online optimization, linear and semidefinite programming, duality, network  optimization, submodular optimization, approximation algorithms via continuous relaxations.",
        "prof": [],
        "reviews": []
    },
    "CASCS535": {
        "id": "CS535",
        "name": "Complexity Theory",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CAS CS 332; or consent of instructor.",
        "prof": [],
        "reviews": []
    },
    "CASCS537": {
        "id": "CS537",
        "name": "Randomness in Computing",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CAS CS 330 or CAS CS 530; . CASCS535 is recommended or consent of instructor.",
        "prof": [],
        "reviews": []
    },
    "CASCS538": {
        "id": "CS538",
        "name": "Fundamentals of Cryptography",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: CAS CS 131 ; CAS CS 237 ; CAS CS 357; or consent of instructor.",
        "prof": [],
        "reviews": []
    },
    "CASCS541": {
        "id": "CS541",
        "name": "Applied Machine Learning",
        "prereqs": "Undergraduate Prerequisites: CS111 (CS112 recommended); CS132 or MA242 (or EK103); CS237 or MA581 (or EK381.) CS365 is recommended.",
        "content": "Covers practical skills in machine learning including techniques for clustering, classification, regression,  feature selection, and model compression. Emphasizes hands-on application of methods via programming on  real- world datasets.",
        "prof": [],
        "reviews": []
    },
    "CASCS542": {
        "id": "CS542",
        "name": "Principles of Machine Learning",
        "prereqs": "Undergraduate Prerequisites: CAS CS 365.",
        "content": "Introduction  to modern machine learning concepts, techniques, and algorithms.  Topics  include regression,  kernels, support vector machines, feature selection,  boosting, clustering,  hidden Markov  models, and Bayesian networks. Programming  assignments emphasize taking  theory into  practice, through applications on  real-world data sets.",
        "prof": [],
        "reviews": []
    },
    "CASCS543": {
        "id": "CS543",
        "name": "Algorithmic Techniques for Taming Big Data",
        "prereqs": "Undergraduate Prerequisites: exposure to basic data structures and algorithms or consent of instructor.",
        "content": "Growing amounts of available data lead to significant challenges in processing   them efficiently. In many cases, it is no longer possible to design feasible   algorithms that can freely access the entire data set. Instead of that we often   have to resort to techniques that allow for reducing the amount of data such as   sampling, sketching, dimensionality reduction, and core sets. Also explores   scenarios in which large data sets are distributed across several machines or   even geographical locations and the goal is to design efficient communication   protocols or MapReduce algorithms. Includes a final project and programming   assignments in which we explore the performance of our techniques when applied   to publicly available data sets.  Effective Fall 2021, this course fulfills a  single unit in each of the following BU Hub areas: Quantitative Reasoning II,  Creativity/Innovation.",
        "prof": [],
        "reviews": []
    },
    "CASCS548": {
        "id": "CS548",
        "name": "Advanced Cryptography",
        "prereqs": "Undergraduate Prerequisites: CAS CS 538; or consent of instructor.",
        "content": "Continuation of CAS CS 538.  Advanced techniques to preserve confidentiality and authenticity against active attacks, zero-knowledge proofs; Fiat-Shamir signature schemes; non-malleable public-key encryption; authenticated symmetric encryption; secure multiparty protocols for tasks ranging from Byzantine agreement to mental poker to threshold cryptography.",
        "prof": [],
        "reviews": []
    },
    "CASCS549": {
        "id": "CS549",
        "name": "Spark! Machine Learning X-Lab Practicum",
        "prereqs": "Undergraduate Prerequisites: CAS CS 505 or CAS CS 542 or CAS CS 585; or consent of instructor. Consent provided upon successful completionof pass/fail diagnostic test that will assess student readiness to take the course.",
        "content": "The Spark! Practicum offers students in computing disciplines the opportunity to  apply their knowledge in algorithms, inferential analytics, and software  development by working on real-world projects provided from partnering  organizations within BU and from outside. The course offers a range of project  options where students can improve their technical skills, while also gaining  the soft skills necessary to deliver projects aligned to the partner's goals.  These include teamwork and communications skills and software development  processes. All students participating in the course are expected to complete a  project focused on an application of inferential analytics or machine learning,  including a final presentation to the partner organization.",
        "prof": [],
        "reviews": []
    },
    "CASCS551": {
        "id": "CS551",
        "name": "Streaming and Event-driven Systems",
        "prereqs": "Undergraduate Prerequisites: CAS CS 112 and CAS CS 210; CAS CS 451 and CAS CS 460 or consent of instructor.",
        "content": "Fundamentals of stream processing and event-driven systems. Topics include Pub/Sub  systems; Distributed streaming systems; Dataflow programming; Fault-tolerance and  processing guarantees; State management; Windowing semantics; Complex event  processing; Microservice architectures; Serverless functions; Examines current and  emerging architectures and use-cases.",
        "prof": [],
        "reviews": []
    },
    "CASCS558": {
        "id": "CS558",
        "name": "Computer Networks Security",
        "prereqs": "Undergraduate Prerequisites: CAS CS 357; or consent of instructor.",
        "content": "This course covers securing core internet infrastructure protocols and  constructing secure, private, and censorship-free communications on the modern  internet. Topics include BGP, ARP, DNS, TLS, censorship-resistant systems like  Tor, end-to-end secure messaging, metadata protection, and trusted execution  environments.",
        "prof": [],
        "reviews": []
    },
    "CASCS561": {
        "id": "CS561",
        "name": "Data Systems Architectures",
        "prereqs": "Undergraduate Prerequisites: CAS CS 210 or equivalent and CAS CS 460/660.",
        "content": "Discusses the design of data systems that can address the modern challenges  of managing and accessing large, ever-growing, diverse sets of data, often  streaming from heterogenous sources, in the context of continuously evolving  hardware and software. We use examples from several data management areas  including relational systems, distributed database systems, key value  stores, newSQL and NoSQL systems, data systems for machine learning (and  machine learning for data systems), interactive analytics, and data  management as a service.  Effective Spring 2021, this course fulfills a  single unit in each of the following BU Hub areas: Oral and/or Signed  Communication, Research and Information Literacy.",
        "prof": [],
        "reviews": []
    },
    "CASCS565": {
        "id": "CS565",
        "name": "Algorithmic Data Mining",
        "prereqs": "Undergraduate Prerequisites: CAS CS 112 ; CAS CS 330 ; CAS CS 365.",
        "content": "Introduction to data mining concepts and techniques. Topics include association and  correlation discovery, classification and clustering of large datasets, outlier detection.  Emphasis on the algorithmic aspects as well as the application of mining in real-world  problems.",
        "prof": [],
        "reviews": []
    },
    "CASCS581": {
        "id": "CS581",
        "name": "Computational Fabrication",
        "prereqs": "Undergraduate Prerequisites: CAS CS 112 and CAS CS 132 or CAS MA 242; CAS 480/GRS CS 680 recommended.",
        "content": "Introduces 3D printing technology and computational methods for creating physical prototypes  from geometric models. Student-led paper presentations cover research from prominent  Computer Graphics and Human Computer Interaction conferences. Culminates in a design  project involving a computational component and physical prototyping.",
        "prof": [],
        "reviews": []
    },
    "CASCS582": {
        "id": "CS582",
        "name": "Geometry Processing",
        "prereqs": "Undergraduate Prerequisites: CAS CS 112 (or equivalent), CAS CS 132 or CAS MA 242 (or equivalent),CAS MA 225 (or equivalent).",
        "content": "Algorithms and data structures for digital processing of triangle meshes and point  clouds. Topics include: surface smoothing, parametrization, and deformation; half- edge data structures; discretized curvature measures; and spectral analysis of  surfaces. Numerical methods for linear algebra and optimization also discussed.",
        "prof": [],
        "reviews": []
    },
    "CASCS583": {
        "id": "CS583",
        "name": "Audio Computation",
        "prereqs": "Undergraduate Prerequisites: CAS CS 112; and understanding of physics equivalent to CAS PY 105.",
        "content": "Introduction to algorithms, data structures, and applications in computer  manipulation of audio signals. Topics include the physical properties of sound  and of musical instruments, representation and synthesis of musical and  environmental sounds, analysis of audio signals using the Fourier Transform, and  topics of current interest in research, including the use of deep learning for  analysis of audio signals. Effective Fall 2021, this course fulfills a single  unit in each of  the following BU Hub areas: Scientific Inquiry II,  Creativity/Innovation.",
        "prof": [],
        "reviews": []
    },
    "CASCS585": {
        "id": "CS585",
        "name": "Image and Video Computing",
        "prereqs": "Undergraduate Prerequisites: CAS CS 132 or CAS MA 242; and CASCS112 or equivalent programming experience and familiarity with calculus.",
        "content": "Introduction to images and video as multimedia data types and algorithms for image and video understanding based on color, shading, stereo, and motion. Topics include face recognition, human-computer interfaces, animal and vehicle tracking, and medical image analysis.",
        "prof": [],
        "reviews": []
    },
    "CASCS599": {
        "id": "CS599",
        "name": "Advanced Topics in Computer Science",
        "prereqs": "",
        "content": "Various advanced topics in computer science that vary semester to semester.  Please contact the CAS Computer Science Department for detailed descriptions.",
        "prof": [],
        "reviews": []
    }
}