[
    {
        "CASEC501": {
            "id": "EC501",
            "name": "Microeconomic Theory",
            "prereqs": "Undergraduate Prerequisites: CASEC201 or equivalent, and either CASEC505 or CASMA225, or consent of instructor.",
            "content": "Covers the basic concepts and mathematical methods of microeconomic theory. Topics  include consumer demand and its foundation on preferences and budget constraints,  economics of uncertainty and imperfect information, production theory, applied competitive  equilibrium analysis, elementary game theory, and imperfect competition.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC502": {
            "id": "EC502",
            "name": "Macroeconomic Theory",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 202 or equivalent, or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC505": {
            "id": "EC505",
            "name": "Elementary Mathematical Economics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS MA 121; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC507": {
            "id": "EC507",
            "name": "Statistics for Economists",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 203 or CAS EC 303; or equivalent and elementary calculus.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC508": {
            "id": "EC508",
            "name": "Econometrics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 507; and for undergraduate students only, (CASEC204 or CASEC304).",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC509": {
            "id": "EC509",
            "name": "Topics in Econometrics with Applications",
            "prereqs": "Undergraduate Prerequisites: coursework in linear algebra and graduate level statistics or consentof instructor.",
            "content": "Matrix-algebra based coverage of cross-sectional econometrics. Topics include linear models,  model selection, large sample theory, instrumental variables, nonlinear estimation, limited  dependent variables, simultaneous equations and panel data. Involves programming in  statistical software. Requires a term paper with original empirical analysis.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC513": {
            "id": "EC513",
            "name": "Game Theory",
            "prereqs": "Undergraduate Prerequisites: CAS MA 121 or CAS MA 122 or CAS MA 123 or CAS MA 124 or CAS MA 127 or CAS MA 129; or instructor's permission.",
            "content": "Mathematical models of decision-making and strategic interactions: basic equilibrium notions  in normal form games, including signaling games and repeated games.  Applications include  auctions, foreign policy, takeover bids, entry deterrence, cooperation and conflict, financial  markets, and public goods.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC515": {
            "id": "EC515",
            "name": "Economics of Information",
            "prereqs": "Undergraduate Prerequisites: CAS EC 201; and one of CAS MA 121, 122, 123, 124, 127 or 129, or consent of instructor.  Recommended: CAS EC 403.",
            "content": "Introduction to mathematical models of information economics and their applications. Covers  a wide range of situations in which players have access to different private information and  this private information differently affects their incentives and strategic behavior.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC517": {
            "id": "EC517",
            "name": "Economic Models of Social Learning and Coordination",
            "prereqs": "Undergraduate Prerequisites: one calculus course numbered CAS MA121 or higher, CAS EC201 or EC501,and EC202 or EC502 (EC515 recommended); or consent of instructor.",
            "content": "Economic models and mathematical analysis of the relationship between rational economic  decisions and flows of information, with diverse micro- and macro- economics.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC521": {
            "id": "EC521",
            "name": "Development Policy",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 201 and CAS EC 202.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC522": {
            "id": "EC522",
            "name": "Development Strategy",
            "prereqs": "Undergraduate Prerequisites: one year of graduate study.",
            "content": "Case study approach to questions of employment, trade, macro-policy, and development  strategy; including relationship between economic growth, economic policy, and income  distribution. Reading of current research; use of real-world data and econometric methods.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC531": {
            "id": "EC531",
            "name": "Market Structure and Industrial Organization",
            "prereqs": "Undergraduate Prerequisites: CAS MA 121; or a more advanced calculus course) and CASEC201 (or a more advanced microeconomics course), or consent of instructor.",
            "content": "Mathematical models and quantitative analysis of the main interactions between firms and  consumers under different market conditions and market structures. Among the issues  discussed: profit maximization, monopoly power, price discrimination, bundling, oligopoly and  imperfect competition, entry deterrence, quality choice, and advertising.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC536": {
            "id": "EC536",
            "name": "Economics of Corporate Organization",
            "prereqs": "",
            "content": "Mathematical models and quantitative analysis of the architecture and performance of firms  and other organizations. Topics include firm boundaries, the allocation of ownership and  control, integration and outsourcing, corporate governance, performance evaluation, and  compensation. May not be taken for credit in addition to CAS EC 436.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC541": {
            "id": "EC541",
            "name": "Topics in Monetary Theory and Macroeconomics",
            "prereqs": "Undergraduate Prerequisites: consent of instructor.",
            "content": "Combines monetary economics, macroeconomics, and finance. Mathematical models and  quantitative analysis of the interactions among money, interest rate, and consumption and  their consequences for monetary policy and asset prices (bonds, stocks, and currencies).   Real-world data and econometric methods are also used.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC542": {
            "id": "EC542",
            "name": "Money and Financial Intermediation",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 341 or CAS EC 342; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC544": {
            "id": "EC544",
            "name": "Introduction to Economic Dynamics",
            "prereqs": "Undergraduate Prerequisites: CASEC201 or EC501, or equivalent; and CASEC202 or EC502, or equivalent; and CASMA121 or MA123 or MA127 or EC505, or equivalent; and CASEC507, or equivalent.",
            "content": "An introduction to the theory and applications of dynamic optimization and equilibrium analysis in discrete  time. Focuses on numerical methods for solving many economic problems. Topics include difference  equations, dynamic programming, and business cycle models.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC545": {
            "id": "EC545",
            "name": "Financial Economics",
            "prereqs": "Undergraduate Prerequisites: CAS EC 201 and CAS EC 202; and (CASEC203 or CASEC303) and one approved Calculus Course (CASMA121, 122, 123, 124, 127, or 129) or consent of instructor.",
            "content": "Provides a sound understanding of the economic principles of finance, including the financial decisions and capital structure of a corporation, and its relation to capital markets. Models of capital asset pricing and investors' behavior are also discussed.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC551": {
            "id": "EC551",
            "name": "Economics of Labor Markets",
            "prereqs": "Undergraduate Prerequisites: CAS EC 201 and CAS EC 202; or consent of instructor.",
            "content": "Economic behavior of labor markets and labor market institutions in the United States. Wage determination, labor allocation, discrimination, economics of trade unions, and industrial relations.  Implications of labor market behaviors for public policy.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC561": {
            "id": "EC561",
            "name": "Public Economics I",
            "prereqs": "Undergraduate Prerequisites: CAS EC 201; or consent of instructor.",
            "content": "Quantitative and microeconomic analysis of public-policy decisions worldwide, by means of  applied welfare economics or cost-benefit analysis. Applications include project evaluation,  taxation, regulation, shadow pricing, privatization, policy impact analysis, and valuation of  external effects such as pollution and congestion.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC563": {
            "id": "EC563",
            "name": "Race and the Development of the American Economy",
            "prereqs": "Undergraduate Prerequisites: CAS EC 101.",
            "content": "Surveys African-American economic history in the context of the development of American  and global economies, using available data and econometrics methods. Topics include:  economics of slavery; race and industrialization; the Great Migration; anti-discrimination  legislation; historical origins of contemporary racial inequalities. (Meets with CAS AA 563.)   BU Hub   Learn More  Historical ConsciousnessSocial Inquiry II",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC565": {
            "id": "EC565",
            "name": "Economic Institutions in Historical Perspective",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 101.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC569": {
            "id": "EC569",
            "name": "African American Economic History",
            "prereqs": "Undergraduate Prerequisites: CAS EC 101; and junior standing.",
            "content": "Introduction to current research in African American economic history. Topics include slavery  and its aftermath, the long-term evolution of racial economic differences, segregation, voting  rights, and anti-discrimination legislation. Also offered as CAS AA 569.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC571": {
            "id": "EC571",
            "name": "Energy and Environmental Economics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 201 or CAS EC 501.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC572": {
            "id": "EC572",
            "name": "Public Control of Business",
            "prereqs": "Undergraduate Prerequisites: CAS EC 201 or CAS EC 501.",
            "content": "Examines economic theory and case studies of antitrust policy, government regulation of private industry and operation of state owned enterprises. Case studies are drawn from both industrialized and developing countries.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC581": {
            "id": "EC581",
            "name": "Health Economics I",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 501; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC590": {
            "id": "EC590",
            "name": "Special Topics in Economics",
            "prereqs": "",
            "content": "May be repeated for credit as topics vary. two topics are offered in Fall 2023. Section AA: Antitrust. Studies markets with imperfect competition in the context of antitrust policy and antitrust enforcement in the United States. Uses tools from microeconomics to study how and why imperfect competition can lead to inefficient and unjust outcomes. Also studies how economists and courts assess markets with imperfect competition in the context of antitrust policy and antitrust enforcement, today and historically. Section BB: Political Economy. Studies game theoretical models of political competition to understand how societies decide on public policies. Discusses the idea of rational choice for a society when the members of that society differ in how they rank different alternatives. Models are applied to public policy issues such as income redistribution and political corruption.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC591": {
            "id": "EC591",
            "name": "International Economics",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 304 and CAS EC 391.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC595": {
            "id": "EC595",
            "name": "International Finance",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: CAS EC 502; or consent of instructor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC597": {
            "id": "EC597",
            "name": "MAEP Internship",
            "prereqs": "Undergraduate Prerequisites: Completion of the MA Economics Core (CASEC501, CASEC502, CASEC507, CASEC508).",
            "content": "(For students starting the program in spring, the prerequisites may be abridged to CASEC501 and  CASEC507 by departmental approval.) With departmental approval, MAEP students may work in an off- campus internship lasting six weeks or more, receive on-the-job training complementing their academic  studies, and earn academic credits towards their degrees. Grades are based on reports from student and  workplace supervisor.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "CASEC598": {
            "id": "EC598",
            "name": "The Economics of Globalization",
            "prereqs": "Undergraduate Prerequisites: CASEC201 or EC501, or equivalent; CASEC203 or EC303  or EC507, or equivalent; CASEC391 or EC591, or equivalent; CASMA121 or MA123 or CASMA127 or EC505, or equivalent; or consent of instructor.",
            "content": "Analyzes various facets of globalization from both theoretical and empirical perspectives, using tools from  international trade theory. Topics include firm-level trade patterns, multinational production, foreign direct  investment, the creation of global vertical supply chains, outsourcing, and offshoring.",
            "prof": [],
            "reviews": []
        }
    }
]