[
    {
        "ENGEK500": {
            "id": "EK500",
            "name": "Probability with Statistical Applications",
            "prereqs": "Undergraduate Prerequisites: CAS MA 226.",
            "content": "A first course in probability, random processes, and statistics for students  with a level of mathematical maturity and experience comparable to that normally  found in entering graduate students. Sample spaces, probability measures, random  variables, expectation, applications of transform methods, stochastic  convergence and limit theorems, second order statistics, introduction to random  processes, estimation, filtering, and elementary hypothesis testing. May not be  taken for credit in addition to ENG EC 381 or ENG ME 308.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK501": {
            "id": "EK501",
            "name": "Mathematical Methods I",
            "prereqs": "",
            "content": "Introduction to basic applied mathematics for science and engineering, emphasizing practical methods and unifying geometrical concepts. Topics include linear algebra for real and complex matrices. Quadratic forms,  Lagrange multipliers and elementary properties of the rotation group. Vector differential and integral calculus. Complex function theory, singularities and multi-valued functions, contour integration and series expansions. Fourier and Laplace transforms. Elementary methods for solving ordinary linear differential and systems of differential equations with applications to electrical circuits and mechanical structures.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK505": {
            "id": "EK505",
            "name": "Introduction to Robotics and Autonomous Systems",
            "prereqs": "Undergraduate Prerequisites: Ordinary differential equations. Linear algebra. Experience with programming",
            "content": "This course will provide the foundation for the study of robotics and autonomous systems. Topics to be covered include modeling techniques (kinematics and dynamics) for a variety of robotic systems, ranging from manipulator arms and car-like vehicles to soft robots, an introduction to control and motion planning for such systems, and concepts of sensing and perception. The course will also discuss the basics of machine learning techniques in robotics and the ethical implications of the field as robotics and automation continue their progression into commonplace tools.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK546": {
            "id": "EK546",
            "name": "Assessment of Sustainable Energy Technologies",
            "prereqs": "Undergraduate Prerequisites: CAS PY 105 or CAS CH 101 or CAS ES 105; or equivalent, CAS MA 121 or equivalent; graduate or junior/senior standing",
            "content": "Critical to launching new energy ventures and implementing new energy policies  is developing a broad understanding of how technically feasible the proposed  project/technology in meeting the economic, environmental, and end-use  requirements.  This course will provide students with the background needed to  assess the potential for energy efficiency and effectiveness of different  technologies, the related economics, as well as identify the key technical risks  in emerging technologies.  Examples will be drawn from a variety of emerging  technologies such as solar photovoltaics, fuel cells, advanced transportation  technology, as well as conservation options such as motors, cogeneration,  building automation and HVAC.  This course will also address evaluating the life  cycle implications of emerging technologies, including manufacturing issues,  end-of-life, as well as estimating performance.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK690": {
            "id": "EK690",
            "name": "Career Lab",
            "prereqs": "",
            "content": "Undergraduate Prerequisites: Graduate student only",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK691": {
            "id": "EK691",
            "name": "Lean and Agile New Product Development",
            "prereqs": "",
            "content": "This 4-credit project-based graduate Engineering elective combines theory  and  practice of modern strategies designed to accelerate and optimize the  product  development process.  Focus will be on value creation rather than  traditional  capacity utilization strategies.  Techniques developed for Lean  Manufacturing  and Agile Software Development will be applied across the full  spectrum of  Engineering new products.  Team-based projects provide  experiential   opportunities designed to fulfill the Practicum requirement  for MEng degree  programs.  This course satisfies one of the requirements for  Leadership courses  in the MEng program.   No prerequisites are are required.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK697": {
            "id": "EK697",
            "name": "Graduate Part-time Engineering Practice",
            "prereqs": "Graduate Prerequisites: MS and MEng students approved for the Engineering Practice degree option.",
            "content": "Students register upon receiving an internship position. The Engineering Practice degree option helps students to integrate classroom theory with actual engineering experience. Under professional supervision, students gain firsthand knowledge about the engineering environment by working in a paid, part-time position in private industry, a governmental agency, or research or medical facility. Part-time position = 15-20 hours per week for at least 10 weeks, and less than 300 hours total per academic term. To maintain status as a full-time student, must be registered for 8-11 credits. Registration for 12 or more credits requires written approval of your faculty advisor. International students must have CPT authorization to register for this course. 0 cr. Pass/Fail. May be taken fall, spring, or summer term.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK698": {
            "id": "EK698",
            "name": "Graduate Engineering Practice",
            "prereqs": "Graduate Prerequisites: MS and MEng students approved for the Engineering Practice degree option.",
            "content": "Students register upon receiving an internship position. The Engineering Practice degree option helps students to integrate classroom theory with actual engineering experience. Under professional supervision, students acquire firsthand knowledge about the engineering environment by working in a paid, full-time position in private industry, a governmental agency, or research or medical facility. Full-time position = 30-40 hours per week for at least 10 weeks per academic term (minimum 300 hours total per academic term). International students must have CPT authorization to register for this course. 0 cr. Pass/Fail. May be taken fall, spring, or summer term.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK731": {
            "id": "EK731",
            "name": "Bench-to-Bedside",
            "prereqs": "",
            "content": "The subject of the course is the translation of medical technologies into new  products and services for the healthcare system. The course begins with a  rigorous study of intellectual property, licensing and the core aspects of  planning, creating, funding and building new entrepreneurial ventures. Concepts  and tools are presented for assessing new technologies and their potential to be  the basis for a new entrepreneurial venture. Comparisons will be made of how  technologies can be sourced and commercialized out of three very different  environments: universities, national laboratories and corporate laboratories.  Cross-disciplinary teams of students will be formed which will evaluate  translational research projects currently being developed at Boston University  and their potential for transformation into a start-up company to commercialize  the technology, providing a unique linkage between the scientific research  activities of the university and the professional schools. Each week there will  be a case study which will discuss examples of both success and failure in  technology commercialization. Some of these case studies examine Boston  University life sciences spin-out companies, and the founders and CEO?s of these  ventures will share their experiences with the class. Same as LAW JO 997, LAW LA 997, QST HM 801. Students may not receive credits for both.",
            "prof": [],
            "reviews": []
        }
    },
    {
        "ENGEK920": {
            "id": "EK920",
            "name": "Summer Research Experience",
            "prereqs": "",
            "content": "By department approval only. Research carried out under the guidance of a faculty  member.",
            "prof": [],
            "reviews": []
        }
    }
]