{
    "ENGME500": {
        "id": "ME500",
        "name": "Special Topics in Mechanical Engineering",
        "prereqs": "",
        "content": "Seminar course on a topic of current interest in aerospace and mechanical engineering."
    },
    "ENGME501": {
        "id": "ME501",
        "name": "Dynamic System Theory",
        "prereqs": "Undergraduate Prerequisites: Familiarity with differential equations and matrices at the level of ENG ME 404 or CAS MA 242, or consent of instructor.",
        "content": "Introduction to analytical concepts and examples of dynamic systems and control.  Mathematical description and state space formation of dynamic systems; modeling, controllability, and observability.  Eigenvector and transform analysis of linear systems including canonical forms.  Performance specifications.  State feedback:  pole placement and the linear quadratic regulator.  Introduction to MIMO design and system identification using computer tools and laboratory experiments. Meets with ENG EC 501 and ENG SE 501; students may not receive credit for both."
    },
    "ENGME502": {
        "id": "ME502",
        "name": "Invention",
        "prereqs": "Undergraduate Prerequisites: (Senior or graduate standing in an engineering or science discipline or consent of instructor)",
        "content": "This course provides students with the knowledge and tools necessary to  create, protect, and commercialize engineering and scientific intellectual  assets. Students will first make use of creativity tools to attack posed  engineering problems, then turn to means for protecting their solutions.  Rapidly growing areas that are affecting nearly all businesses (e.g.,  software and the internet) as well as \"high-tech\" areas including  microelectronics, communications, and bioengineering will be emphasized.  Extensive patent searches and analysis will be carried out to develop skills  for quickly ascertaining the protected technical content of patents, and for  recognizing what intellectual property (IP) should be and can be protected.  Legal aspects for protecting creative ideas will be studied at a level  appropriate for engineers to interact easily and smoothly during their  technical careers with IP lawyers. Various business models for the  commercialization of intellectual assets will be analyzed. Extensive class  exercises and projects will explore in depth all three of these important  areas of IP, with emphasis on key contributions during engineering and  scientific research and development activities."
    },
    "ENGME503": {
        "id": "ME503",
        "name": "Kinetic Processes in Materials",
        "prereqs": "Undergraduate Prerequisites: Undergraduate course in materials science and engineering.",
        "content": "Kinetics of mass transport, continuum and atomistic approaches, chemical diffusion; kinetics of chemical reactions, kinetics of adsorption and evaporation; nucleation and growth; solidification; spinodal decomposition; coarsening; martensitic transformations; order-disorder reactions; point defects and their relation to transport kinetics. Meets with ENGMS503; students may not receive credit for both."
    },
    "ENGME504": {
        "id": "ME504",
        "name": "Polymers and Soft Materials",
        "prereqs": "",
        "content": "An introduction to soft matter for students with background in materials science, chemistry, and physics. This course covers general aspects of structures, properties, and applications of soft materials such as polymers, colloids, liquid crystals, amphiphiles, gels, and biomaterials. Emphasis on chemistry and forces related to molecular self-assembly. Topics include forces, energies, kinetics in material synthesis, growth and transformation; methods for preparing synthetic materials; formation, assembly, phase behavior, and molecular ordering of synthetic soft materials; structure, function, and phase transition of natural materials such as nucleic acids, proteins, polysaccharides, and lipids; techniques for characterizing the structure, phase, and dynamics of soft materials; application of soft materials in nanotechnology. Meets with ENG BE and MS 504; students may not receive credit for both."
    },
    "ENGME505": {
        "id": "ME505",
        "name": "Thermodynamics and Statistical Mechanics",
        "prereqs": "Undergraduate Prerequisites: Undergraduate course in Thermodynamics.",
        "content": "The laws of thermodynamics; general formulation and applications to mechanical, electromagnetic and electromechanical systems; thermodynamics of solutions, phase diagrams; thermodynamics of interfaces, adsorption; defect equilibrium in crystals; statistical thermodynamics, including ensembles, gases, crystal lattices, and phase transitions.  Same as ENGMS505; students may not receive credit for both."
    },
    "ENGME506": {
        "id": "ME506",
        "name": "Engineering Device Applications",
        "prereqs": "Undergraduate Prerequisites: Senior or graduate standing in the Engineering, Physics, or the Chemistry disciplines, or consent of instructor.",
        "content": "Senior or graduate standing in the engineering, physics, or the chemistry disciplines, or consent of instructor. Topics include many sensors and actuators, including accelerometers and piezoelectric devices, as well as many other electromechanical devices, plus lasers, quantum dots, atomic force microscope, ellipsometry, plasma etching, advanced semiconductor based devices, scanning electron microscopes, and open to other student suggested directions. Such devices are used considerably in engineering, science, and technology, as well as in commercial high \"tech\" products, and for instrumentation and measuring purposes. Many devices will be taken apart and analyzed in terms of the operation,physics, design, device optimization, plus considerations of possible deviations from the original design. The intent here is that a confident mastery of these devices will improve the use and application of these devices for engineers, as well as provide a guide where jobs might be obtained in the use and possible enhancements of these devices. About 20 physical demonstrations will be given during the course."
    },
    "ENGME507": {
        "id": "ME507",
        "name": "Process Modeling and Control",
        "prereqs": "Undergraduate Prerequisites: ENG EK 307 or CAS MA 226; or equivalent coursework and permission of the instructor. Senior or graduate standing in engineering.",
        "content": "An introduction to modeling and control as applied to industrial unit processes providing the basis for process development and improvement.  Major themes include an integrated treatment of modeling multi-domain physical systems (electrical, mechanical, fluid, thermal), application of classical control techniques, and system design.  Topics include modeling techniques, analysis of linear dynamics, control fundamentals in the time and frequency domain, and actuator selection and control structure design.  Examples drawn from a variety of manufacturing processes and case studies. Meets with ENGMS507.  Students may not receive credit for both."
    },
    "ENGME510": {
        "id": "ME510",
        "name": "Production Systems Analysis",
        "prereqs": "Undergraduate Prerequisites: ENG ME 345; or consent of instructor",
        "content": "Operations research and dynamic systems methods applied in modeling, analysis, and control of production systems. Inventory analysis and control for single and multi-item systems based on deterministic and stochastic demand models. Demand forecasting. Supply chain management. Machine, flow shop and job shop scheduling, project scheduling with PERT and CPM. Production control methods: MRP, MRP-II, Just-in-Time, and Kanban."
    },
    "ENGME514": {
        "id": "ME514",
        "name": "Simulation",
        "prereqs": "Undergraduate Prerequisites: ENG EK127 or  knowledge of general programming language; CAS MA 381",
        "content": "Modeling of discrete event systems and their analysis through simulation. Systems considered include, but are not limited to, manufacturing systems, computer-communication networks and computer systems. Simulating random environments and output analysis in such contexts. A simulation language is introduced and is the main tool for simulation experimentation. Same as ENG EC 514; students may not receive credit for both."
    },
    "ENGME515": {
        "id": "ME515",
        "name": "Vibration of Complex Mechanical Systems",
        "prereqs": "Undergraduate Prerequisites: CAS MA 226 and ENG ME 302.",
        "content": "Analysis of free and forced vibration of multidegree-of-freedom systems. Analysis of free and forced vibration of continuous systems such as strings, bars, beams, and membranes. Introduction to vibration control, vibration isolation, and vibration absorbers. Introduction to vibration sensors. Analysis of free and forced vibration of systems and structures modeled with the finite element method. Students learn computational implementation of all analyses."
    },
    "ENGME516": {
        "id": "ME516",
        "name": "Statistical Mechanical Concepts in Engineering",
        "prereqs": "Undergraduate Prerequisites: ENG ME 303 ; ENG ME 304 ; ENG ME 419.",
        "content": "Statistical mechanics uses probability theory to establish a connection  between the microscopic properties of individual molecules and macroscopic  properties of matter, such as temperature, pressure, entropy, heat capacity  and viscosity. Review of thermodynamics. Fundamentals of probability theory.  Phase space dynamics. Ensembles and averages. Statistical formulation of   photons (Light), phonons (lattice vibrations in solids), electrons in a  metals and classical gases. Classical transport. Introduction to non- equilibrium phenomena."
    },
    "ENGME517": {
        "id": "ME517",
        "name": "Product Development",
        "prereqs": "Undergraduate Prerequisites: Senior or graduate standing in an engineering discipline",
        "content": "Dynamics of converting ideas into marketable products. Choosing products and defining their specifications to achieve competitive advantage. The product development process is decomposed and its elements are examined critically in the context of actual case studies; risk evaluation, concurrent engineering, and impact of new product decisions on the factory. A step-by-step methodology for new product development is derived."
    },
    "ENGME518": {
        "id": "ME518",
        "name": "Product Quality",
        "prereqs": "Undergraduate Prerequisites: consent of instructor",
        "content": "Introduction to statistical methods for design, control and improvement of quality. Includes Statistical Process and Quality Control (SPC & SQC) and Acceptance Sampling. Extensive coverage of Design of Experiments (DOE) with applications to designing quality into products and to process and product performance improvement. Also covers Robust Design and Taguchi's method. Introduction to modern approaches to management of quality (TQM, Six Sigma)."
    },
    "ENGME519": {
        "id": "ME519",
        "name": "Theory of Heat Transfer",
        "prereqs": "Undergraduate Prerequisites: ENG ME 419.",
        "content": "Analytical, numerical, and physical aspects of heat transfer phenomena, with emphasis on nondimensionalization and scaling. Mathematical treatment of steady and unsteady conduction, including finite difference methods. Forced and natural convection in internal and external flows. Thermal radiation and multimode heat transfer. Melting and solidification. Applications to aerospace heat transfer, energy systems, manufacturing, and biological heat transfer."
    },
    "ENGME520": {
        "id": "ME520",
        "name": "Acoustics I",
        "prereqs": "Undergraduate Prerequisites: ENG ME 302 ; ENG ME 303 ; ENG ME 304.",
        "content": "Introduction to wave propagation and sound. Derivation of the linear wave  equation with emphasis on its origins in the conservation equations of fluid  media and fluid equations of state.  Plane wave and spherical wave  propagation.  Initial value and boundary value problems, including normal  modes and waveguides.  General concepts such as acoustic impedance and  intensity. Lumped elements.  The wave equation in horns and stratified  media.  Other topics may include biomedical ultrasound, acoustic levitation,  etc... as time permits."
    },
    "ENGME521": {
        "id": "ME521",
        "name": "Continuum Mechanics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 303 or ENG BE 436; and ENGME304 or ENGEK424; and ENGME305 or ENGBE420, or by consent of instructor",
        "content": "The main goal of this course is to present a unified, mathematically rigorous approach to two classical branches of mechanics: the mechanics of fluids and the mechanics of solids.  Topics will include kinematics, stress analysis, balance laws (mass, momentum, and energy), the entropy inequality, and constitutive equations in the framework of Cartesian vectors and tensors. Emphasis will be placed on mechanical principles that apply to all materials by using the unifying mathematical framework of Cartesian vectors and tensors.  Illustrative examples from biology and physiology will be used to describe basic concepts in continuum mechanics. The course will end at the point from which specialized courses devoted to problems in fluid mechanics (e.g. biotransport) and solid mechanics (e.g. cellular biomechanics) could logically proceed; Same as ENG BE 521. Students may not receive credit for both."
    },
    "ENGME524": {
        "id": "ME524",
        "name": "Skeletal Tissue Mechanics",
        "prereqs": "Undergraduate Prerequisites: ENG EK 301 ; ENG ME 302 ; ENG ME 305 ; ENG ME 309 ; CAS MA 242; or equivalent",
        "content": "The course is structured around classical topics in mechanics of materials and their application to study of the mechanical behavior of skeletal tissues, whole bones, bone-implant systems, and diarthroidal joints.  Topics include:  mechanical behavior of tissues, (anisotropy, viscoelasticity, fracture and fatigue) with emphasis on the role of the microstructure of these tissues; structural properties of whole bones and implants (composite and asymmetric bean theories); and mechanical function of joints (contact mechanics, lubrication, and wear).  Emphasis is placed on using experimental data to test and to develop theoretical models, as well as on using the knowledge gained to address common health related problems related to aging, disease, and injury.  Meets with ENG MS 524 and ENG BE 524. Students may not receive credit for both."
    },
    "ENGME525": {
        "id": "ME525",
        "name": "Technology Ventures",
        "prereqs": "Undergraduate Prerequisites: Senior or graduate standing in an engineering or science discipline, or consent of instructor.",
        "content": "An introduction to the formation and management of technology-based enterprises  for engineers and scientists. Modules include opportunity recognition and  evaluation, gathering financial and human resources, and managing and  harvesting ventures. Goals include an understanding of basic start-up finance  and accounting, writing business plans, presenting venture ideas to industry  experts, and venture leadership skills. Students become familiar with  fundamental technical and engineering issues in a wide variety of high-tech  industries, especially information technology, life sciences, biotechnology and  telecommunications. Case studies, lectures, workshops, and projects are  utilized."
    },
    "ENGME526": {
        "id": "ME526",
        "name": "Simulation of Physical Processes",
        "prereqs": "Undergraduate Prerequisites: Senior or graduate standing in the engineering, physics, or the chemistry disciplines, or consent of instructor.",
        "content": "Modern simulation methods are covered for describing and analyzing the  behavior of realistic nonlinear systems that occur in the engineering and  science disciplines. By developing and applying such methods and tools, much  deeper understanding, insight, and control of novel technologies can be  gained, thereby often greatly aiding technology development, and sometimes  providing the leverage to turn a novel technology into a practical reality.  Physical and numerical changes of scales necessary for modeling macro-,  meso-, and nanoscopic phenomena will be covered. Advanced numerical methods  will be addressed for attacking nonlinear partial differential equations, as  well as key aspects of the finite element method. Extensive use will be made  of the modern computational tools Mathematica and COMSOL. Examples will be  covered that include problems in micro and nanoelectronics, bioengineering,  material science, photonics, and physics. Connections of these examples to  sensing instrumentation and control will be made. Same as MS 526. Students may not receive credit for both."
    },
    "ENGME527": {
        "id": "ME527",
        "name": "Transport Phenomena in Materials Processing",
        "prereqs": "Undergraduate Prerequisites: ENG ME 304; or equivalent or consent of instructor",
        "content": "Introduction to momentum, heat and mass transport phenomena occurring in various processes.  Whereas transport phenomena underlie many processes in engineering, agriculture, meteorology, physiology, biology, analytical chemistry, materials science, pharmacy and other areas, they are key to specific applications in diverse areas such as materials processing, green manufacturing of primary materials, biological membranes, fuel cell engineering, synthesis of clean fuels.  This course covers three closely related transport phenomena: momentum transfer (fluid flow), energy transfer (heat flow) and mass transfer (diffusion).  The mathematical underpinnings of all three transport phenomena are closely related and the differential equations governing them are frequently quite similar.  Since in many situations the three transport phenomena occur together, they are presented and studied together in this course. Meets with ENGMS527.  Students may not receive credit for both."
    },
    "ENGME528": {
        "id": "ME528",
        "name": "Biological Physics",
        "prereqs": "Undergraduate Prerequisites: Graduate standing or instructor consent. Introductory courses in hydrodynamics, thermodynamics, math (Fornier transform) and standard Calculus.",
        "content": "This course offers an introduction to biological physics and consists of four  blocks. 1)Thermodynamics and statistical physics with a particular focus on  Einstein's approach. 2)Physics of (Bio) polymer networks. 3) Nano and  Microfluidics and life and low Reynold numbers. 4) Interface physics and  biomembranes."
    },
    "ENGME533": {
        "id": "ME533",
        "name": "Energy Conversion",
        "prereqs": "Undergraduate Prerequisites: ENG ME 304.",
        "content": "Thermodynamic and mechanical aspects of modern conventional energy conversion  systems, including steam electric power plants, gas turbine and internal  combustion engines, and refrigeration systems. Combined cycle and cogeneration  are also considered, as well as economic and environmental aspects of energy  conversion. Includes design project."
    },
    "ENGME535": {
        "id": "ME535",
        "name": "Green Manufacturing",
        "prereqs": "Undergraduate Prerequisites: Senior/graduate standing; CASCH101 or CASCH131; CASMA226; ENGME304 orENGEK424; or consent of instructor.",
        "content": "Provides a systems view of the manufacturing process that aims to efficiently use energy, water, and raw materials to minimize air and water pollution and generation of waste per unit of the manufactured product. Specifically, the course will discuss methods to maximize yield and minimize waste effluents in processes, ways to devise treatment strategies for handling manufacturing wastes, innovative ways to decrease energy consumption in manufacturing, by-product use and product recycling, and policies that encourage green manufacturing. Same as ENG MS 535.  Students may not receive credits for both."
    },
    "ENGME537": {
        "id": "ME537",
        "name": "Product Realization",
        "prereqs": "",
        "content": "This course focuses on the essential and challenging process of getting a design from the drawing board into the hands of a customer. Cases are drawn from a range of industries, technologies and development speeds (everything from hardware startups to aircraft).  It includes topics such as Design for Manufacturing, validation testing, cash flow modeling, in vs outsourcing, setting up a factory, selecting supplier partners, distribution, and ongoing product support.  There will be a semester long project to build and prototype a small production line."
    },
    "ENGME538": {
        "id": "ME538",
        "name": "Introduction to Finite Element Methods and Analysis",
        "prereqs": "Undergraduate Prerequisites: ENG ME 305, Linear Algebra, Ordinary differential equations.",
        "content": "This class serves as an introduction to linear finite element method, and its application to static and dynamic problems with an emphasis on solid mechanics. The first half of the course will use the stiffness and energy approaches to developing the finite element equations as applied to bars, beams and trusses. Lab sessions will focus on learning how to utilize commercially-relevant finite element software to find numerical solutions to problems in solid mechanics. The second half of the course will focus on developing the finite element method as one that is applicable as a general numerical method for solving ordinary and partial differential equations that arise in all areas of science and engineering, including solid and fluid mechanics, thermal systems and electrostatics."
    },
    "ENGME539": {
        "id": "ME539",
        "name": "No longer offered",
        "prereqs": "",
        "content": "No longer offered"
    },
    "ENGME541": {
        "id": "ME541",
        "name": "Classical and Non-Equilibrium Thermodynamics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 304.",
        "content": "First law and second law.  Entropy.  Extremum principles.  Gases, liquids, and  solids.  Phase transition.  Solutions.  Kinetics.  Fields and internal degrees  of freedom.  Non-equilibrium systems.  Radiation.  Biological systems.  Small  systems.  Stability theory.  Critical phenomena.  Statistical mechanics."
    },
    "ENGME542": {
        "id": "ME542",
        "name": "Advanced Fluid Mechanics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 303",
        "content": "Incompressible fluid flow. Review of control-volume approach to fluids  engineering problems, with advanced applications. Differential analysis of fluid  motion. Derivation of full Navier-Stokes, Euler, and Bernoulli equations.  Unsteady Bernoulli equation. Velocity potential and its application to steady 2D  flows. Vorticity and vortex motion."
    },
    "ENGME543": {
        "id": "ME543",
        "name": "Sustainable Power Systems",
        "prereqs": "Undergraduate Prerequisites: Senior standing or consent of instructor.",
        "content": "Breakthroughs in clean energy generation technologies and the advantage of  exploiting efficiently the available work in fossil fuels will render  electricity the dominant energy form in a sustainable environment future. We  review the key characteristics of Electric Power Transmission and  Distribution (T&D) networks and the associated planning and operation  requirements that ensure supply adequacy, system security and stability.  Capital asset investment and operation cost minimization is discussed in a  systems engineering context where the assets as well as the dynamic behavior  of generators, T&D networks, and loads interact. Recent developments in the  formation of competitive wholesale markets at the High Voltage Transmission  system level, the associated market participation and clearing rules and the  market clearing optimization algorithms are presented and analyzed in terms  of their effectiveness in fostering cost reflective price signals and  competitive conditions that encourage optimal distributed/not-centralized  investment and operating decisions. Finally, we present T&D congestion and  supply-demand imbalance related barriers to the widespread adoption of  environmentally friendly and economically efficient technological  breakthroughs, and propose a systems engineering and real-time retail-market  based coordination of centralized as well as decentralized generation,  storage and load management resources that is able to achieve desirable  synergies and mitigate these barriers.  Same as ENG EC 543 and ENG SE 543. Students may not receive credits for both."
    },
    "ENGME544": {
        "id": "ME544",
        "name": "Networking the Physical World",
        "prereqs": "Undergraduate Prerequisites: ENGEC312 & ENGEC450 or equivalent. ENGEC441 is desirable. C programming experience.",
        "content": "Considers the evolution of embedded network sensing systems with the introduction of wireless network connectivity. Key themes are computing optimized for resource constrained (cost, energy, memory and storage space) applications and sensing interfaces to connect to the physical world. Studies current technology for networked embedded network sensors including evolving protocol standards. A laboratory component of the course introduces students to the unique characteristics of distributed sensor motes including programming, reliable communication, sensing modalities, calibration, and application development.  Experience with the C language is required.Same as ENG EC 544 and ENG SE 544. Students may not receive credit for both."
    },
    "ENGME545": {
        "id": "ME545",
        "name": "Electrochemistry of Fuel Cells and Batteries",
        "prereqs": "Undergraduate Prerequisites: ENG ME 505.",
        "content": "Topics covered include Fundamental Electrochemistry of solid-state materials as well as aqueous and non-aqueous systems including molten salts. Thermodynamics and kinetics of electrode reactions and associated mass transport in electrochemical systems. Measurements techniques (dc polarization, ac impedance spectroscopy, blocking electrodes, etc.) used in characterizing electrochemical systems. Design of devices including fuel cells, batteries, and sensors. Electrochemical processes including membrane separation and electrolysis.  Same as ENG MS 545.  Students may not receive credits for both."
    },
    "ENGME546": {
        "id": "ME546",
        "name": "Introduction to Micro/Nanofluidics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 303 and ENG ME 419; or consent of instructor",
        "content": "This course is an introductory graduate course in mechanical engineering. It is  aiming to introduce unique transport phenomena and major applications of    micro/nanofluidics to senior undergraduates and new graduate students. Topics   include overview of micro/nanofluidics, scaling laws, intermolecular forces,   lubrication theory, surface tension and Marangoni flow, chaotic  mixing,   electrowetting, electrokinetics, dielectrophoresis, chemical reaction in   confined space, micro/nano fabrication, etc. Special emphasis will be focused   on understanding fundamental mechanism of transport phenomena at the   micro/nanoscale."
    },
    "ENGME547": {
        "id": "ME547",
        "name": "Introduction to Computational Fluid Dynamics",
        "prereqs": "Undergraduate Prerequisites: Calculus, linear algebra, differential equations, first course in fluid mechanics",
        "content": "This course will prepare students in the fundamentals of the computational approach to study fluid flow problems, and will provide a deeper understanding of the physical models and governing equations of fluid dynamics.  It will also present an opportunity to learn the basic skills of programming solutions to differential equations, and present an overview of essential numerical techniques. Students will develop finite difference based computer models as part of the \"12 Steps\" to numerically solving the laminar Navier-Stokes equations. Consistency, stability and convergence of the numerical methods will be discussed. Extensions to turbulent flows will be considered. The students will be introduced to an open source CFD code and will explore numerical solutions to problems in fluid mechanics using the code."
    },
    "ENGME549": {
        "id": "ME549",
        "name": "Structures and Function of the Extracellular Matrix",
        "prereqs": "",
        "content": "This is an introductory course dealing with the detailed structure of the  basic   units of the extracellular matrix including collagen, elastin,  microfibrils, and   proteoglycans as well as the functional properties such  as elasticity at   different scales from molecule to fibrils to organ level  behavior. The   biological role of these components and their interaction  with cells is also   covered. Interaction of enzymes and the matrix in the  presence of mechanical   forces is discussed. Mathematical modeling is  applied at various length scales   of the extracellular matrix that provides  quantitative understanding of the   structure and function relationship.  Special topics include how diseases affect   extracellular matrix in the  lung, cartilage, and vasculature. The relevance of   the properties of  native extracellular matrix for tissue engineering is also   discussed.  Same as ENG BE 549 and ENG MS 549. Students may not receive credit for both."
    },
    "ENGME555": {
        "id": "ME555",
        "name": "MEMS",
        "prereqs": "Undergraduate Prerequisites: Graduate status or consent of the instructor.",
        "content": "This course will explore the world of microelectromechanical systems (MEMS) and  NEMS. This requires an awareness of design, fabrication, and materials issues  involved in micro/nanosystems. We will go over this through a combination of  lectures, case studies, and individual homework assignments. The course will  cover fabrication technologies, material properties, structural mechanics, basic  sensing and actuation principles, packaging, and MEMS markets and applications.  The course will emphasize the fabrication and materials of micro/nanosystems.  This is not because the other parts aren't important. Instead, it is because  with fabrication and materials expertise there is something concrete you can do  that will always help. When we exam special topics and case studies, a lot of  these other pieces will be put together.  Same as ENG MS 555. Students may not receive credit for both."
    },
    "ENGME557": {
        "id": "ME557",
        "name": "Additive Manufacturing",
        "prereqs": "",
        "content": "This course will teach the fundamentals of Additive Manufacturing (AM) theory and how AM is being used in industry to accelerate product development and replace more traditional low-volume and high volume manufacturing processes.  Topics will cover the technologies, methods and applications or a range of additive methods including FDM (Fused Deposition Modeling), SLA (Sterolithography) and MLS(Metal Laster Sintering), methods for designing for additive will be covered, and implications of additive manufacturing in the complete product life-cycle. We will use the equipment in EPIC to demonstrate and practice the design and production of additive parts."
    },
    "ENGME560": {
        "id": "ME560",
        "name": "Precision Machine Design and Instrumentation",
        "prereqs": "Undergraduate Prerequisites: Senior or graduate standing with basic CAD experience or consent of instructor.",
        "content": "This interdisciplinary course teaches the student how to design, instrument,  and control high-precision, computer-controlled automation equipment, using  concrete examples drawn from the photonics, biotech, and semi-conductor  industries. Topics covered include design strategy, high-precision mechanical  components, sensors and measurement, servo control, design for controllability,  control software development, controller hardware, as well as automated error  detection and recovery.  Students will work in teams, both in-classroom and  out-of-classroom, to integrate and apply the material covered in class to a  term-long multi-part design project in PTC Pro-Engineer or other comparable CAD  system, culminating in a group presentation at the end of the class."
    },
    "ENGME566": {
        "id": "ME566",
        "name": "Advanced Engineering Mathematics",
        "prereqs": "Undergraduate Prerequisites: CAS MA 225 and CAS MA 226; Senior standing, and consent of instructor.",
        "content": "Introduces students of engineering to various mathematical techniques which are necessary in order to solve practical problems. Topics covered include a review of calculus methods, elements of probability and statistics, linear algebra, transform methods, difference and differential equations, numerical techniques, and mathematical techniques in optimization theory. Examples and case studies focus on applications to several engineering disciplines. The intended audience for this course is advanced seniors and entering MS engineering students who desire strengthening of their fundamental mathematical skills in preparation for advanced studies and research."
    },
    "ENGME568": {
        "id": "ME568",
        "name": "Soft Robotic Technologies",
        "prereqs": "Undergraduate Prerequisites: CAD, Instrumentation (electronic boards-reading/acquiring signal), basic Material science, structural mechanics, basic fluid mechanics, Matlab programming",
        "content": "Thia course will introduce students to the field of soft robotics and more generally to non-conventional actuation (e.g. shape memory alloys, soft fluidic actuators, electroactive polymers, etc.) and sensing technologies (soft and flexible technologies based on resistive, capacitive, and optics). They will learn the fluid physics principles that drive them and how they can be designed, manufactured, and integrated into functional soft robotic systems. The class will have a substantial experimental hands-on component during which students will learn challenges and opportunities in the design, manufacturing, modeling, and control of such systems. They will also learn how to apply these technologies to address current shortcomings of traditional rigid robotics."
    },
    "ENGME570": {
        "id": "ME570",
        "name": "Robot Motion Planning",
        "prereqs": "Undergraduate Prerequisites: CAS MA 142 and CAS MA 226; or ENGEK102",
        "content": "Provides an overview of state-of-the-art techniques for robot motion planning. The emphasis is on the algorithms. It covers topology of configuration spaces, potential functions, roadmaps, cell decompositions, sampling-based algorithms, and model checking approaches to robot motion planning and control."
    },
    "ENGME571": {
        "id": "ME571",
        "name": "Medical Robotics",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: Consent of Instructor"
    },
    "ENGME576": {
        "id": "ME576",
        "name": "Nanomanufacturing and Hierarchical Materials",
        "prereqs": "Undergraduate Prerequisites: ENG ME 304 ; ENG ME 305 ; ENG ME 306; Senior, or graduate standing",
        "content": "Nanoscale materials are often celebrated as having unique properties that exceed their bulk counterparts. However, leveraging such nanoscale materials as components in bulk materials is challenging as it requires (1) making enough material to be relevant on bulk scales and (2) incorporating nanomaterials at a bulk scale in amannerso as to maximize their effect. The structural ordering of these nanomaterials can range from disordered, as in the case of nanocomposites, to highly ordered, as is generally the case in metamaterials. This course is designed to communicate he state-of-the-art, challenges, and opportunities of constructing hierarchical materials with nanoscale constituents. Same as ENG MS 576. Students may not receive credits for both."
    },
    "ENGME579": {
        "id": "ME579",
        "name": "Nano/microelectronic Device Technology",
        "prereqs": "Undergraduate Prerequisites: Consent of instructor.",
        "content": "The main physical processes and manufacturing strategies for the fabrication  and manufacture of micro and nanoelectronic devices will be covered, mostly  for silicon, although exciting materials such as graphene and carbon  nanotubes will also be covered.  A key emphasis here will be on electron- hole transport, band structure, basic quantum effects, and the use of  engineering and physical effects to alter semiconductor device performance.   Photolithography, a significant factor in manufacturability, will be covered  in some detail, and to a lesser degree, so will doping methods, diffusion,  oxidation, etching, and deposition. The overall integration with methods and  tools employed by device and circuit designers will be covered. Same as ENG  EC 579; students may not receive credit for both."
    },
    "ENGME580": {
        "id": "ME580",
        "name": "Theory of Elasticity",
        "prereqs": "Undergraduate Prerequisites: ENG ME 309; or equivalent",
        "content": "An introduction to the general theory of solid deformation; small deformation emphasized. Topics include: Cartesian tensors, indicial notation. Introduction to continuum mechanics: deformation of continuous media, deformation gradient, strain definitions. Stress, Cauchy's postulate, Cauchy and Piola-Kirchhoff stress tensors. Balance laws. Constitutive equations, strain energy and Green's postulate. Linear Elasticity: Two dimensional problems, Airy stress function, in plane loading of strips, St. Venant's principle, complex variable methods, Goursat-Muskhelishvili representation, stress concentrations around holes and cracks. Three dimensional problems, Kelvin's solution, the Boussinesq problem, Hertzian contact, Eshelby's energy-momentum tensor. Same as ENG MS 580.  Students may not receive credits for both."
    },
    "ENGME582": {
        "id": "ME582",
        "name": "Mechanical Behavior of Materials",
        "prereqs": "Undergraduate Prerequisites: ENG ME 309",
        "content": "Fundamental concepts of modern materials behavior and materials engineering. Emphasis on analytical and numerical methods for predicting material properties and behavior, as well as some discussion of the relationships between solid structure and material properties. Topics include: constitutive relations, fracture, fatigue, plasticity, creep, damping, impact, and deformation. Elastic, plastic, and viscous behavior. Some discussion of the effects of processing--thermodynamics, kinetics--may be addressed. Specific examples from ceramics, metals, polymers, and composites is given, with the emphasis changing for each offering. Same as ENG MS 582.  Students may not receive credist for both."
    },
    "ENGME583": {
        "id": "ME583",
        "name": "Product Management",
        "prereqs": "Undergraduate Prerequisites: Graduate standing or consent of instructor.",
        "content": "Planning and execution of the process of bringing new tangible and intangible products to market.  Review of the new product development process.  Establishment of the new product specification.  Setting of financial expectations.  Formation and dynamics of the product implementation team.  Organization of the new product introduction project including matrixed management and financial control.  Contingency planning and risk management.  Taught through case-based discussions, lectures, and readings."
    },
    "ENGME584": {
        "id": "ME584",
        "name": "Manufacturing Strategy",
        "prereqs": "Undergraduate Prerequisites: ENG ME 420 or ENG ME 510; or consent of instructor",
        "content": "Strategic decision-making for technical people in manufacturing companies.    Provides practice in applying financial, organizational, and operational   concepts through analysis and discussion of case situations. Topics include    process alternatives and their implications; interactions among product design,   process design, worker skill and worker motivation; supplier relationships;   interfaces with marketing and finance; introduction of new technology; capacity   planning; and competitive analysis. Taught principally by in-class discussion   plus guest lectures."
    },
    "ENGME606": {
        "id": "ME606",
        "name": "Industrial Practicum",
        "prereqs": "Undergraduate Prerequisites: Enrollment in the Manufacturing Engineering MS or MEng program, or consent of instructor.",
        "content": "The industrial practicum practicum is a semester-long team project based on problems with industrial relevance.  Conducted in an industrial environment, the goal of the practicum is to provide students with hands-on experience to supplement their theoretical knowledge, and to help them further develop professional competencies. Oral presentation and written project report required."
    },
    "ENGME690": {
        "id": "ME690",
        "name": "Advanced Product Design",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: Graduate standing or permission of the instructor."
    },
    "ENGME691": {
        "id": "ME691",
        "name": "Advanced Product Design and Engineering",
        "prereqs": "Graduate Prerequisites: Graduate standing in an an engineering discipline. Previous courses in materials science, CAD, FEA, structures. Basic programming and electrical engineering. Experience building and testing prototypes",
        "content": "Fall Semester; part of a two-term sequence with ENG ME 692  Advanced Product Design and Engineering is focused on the tools and skills enabling smart, practical product engineering choices. A \"proactive\" mechanical engineer creates  products and systems that are functional, manufacturable and economically successful, even as user expectations and technologies evolve. Students are expected to perform original research on design and engineering trends, apply advanced engineering methods to specific examples, justify their their conclusions in design reviews, and ultimately create a manufacturable design prototype. Grading based on a mix of team and individual assignments."
    },
    "ENGME692": {
        "id": "ME692",
        "name": "Advanced Product Design and Engineering",
        "prereqs": "Graduate Prerequisites: Graduate standing in an an engineering discipline. Previous courses in materials science, CAD, FEA, structures. Basic programming and electrical engineering.",
        "content": "Spring Semester; part of a two-term sequence with ENG ME 691. Advanced Product Design and Engineering is focused on the tools and skills enabling smart, practical product engineering choices. A \"proactive\" mechanical engineer creates products and systems that are functional, manufacturable, and economically successful, even as user expectations and technologies evolve. Students are expected to perform original research on design and engineering trends, apply advanced engineering methods to specific examples, justify their conclusions in design reviews, and ultimately create a manufacturable design prototype. Grading based on a mix of team and individual assignments."
    },
    "ENGME700": {
        "id": "ME700",
        "name": "Advanced Topics in Mechanical Engineering",
        "prereqs": "Undergraduate Prerequisites: Graduate standing or consent of instructor.",
        "content": "Specific prerequisites vary according to research topic."
    },
    "ENGME701": {
        "id": "ME701",
        "name": "Optimal and Robust Control",
        "prereqs": "Undergraduate Prerequisites: ENG ME 501 or ENG EC 501 or ENG SE 501; or equivalent",
        "content": "This course is aimed at an introduction (with rigorous treatment) to the fundamentals of optimal and robust control.  It will be divided roughly into two parts.  The first will cover aspects of robust control including model reduction, H_2 and H_ infinity control, and feedback control of uncertain systems.  The second will delve into optimal control including topics such as the linear quadratic regulator, the calculus of variations, the maximum principle, and the Hamilton-Jacobi-Bellman equation. Same as ENG EC 701 and ENG SE 701. Students may not receive credits for both."
    },
    "ENGME702": {
        "id": "ME702",
        "name": "Computational Fluid Dynamics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 542.",
        "content": "Numerical techniques for solving the Navier-Stokes and related equations. Topics are selected from the following list, although the emphasis may shift from year to year: boundary integral methods for potential and Stokes flows; free surface flow computations; panel methods; finite difference, finite element and finite volume methods; spectral and pseudo-spectral methods; vortex methods; lattice-gas and lattice-Boltzmann techniques; numerical grid generation."
    },
    "ENGME710": {
        "id": "ME710",
        "name": "Dynamic Programming and Stochastic Control",
        "prereqs": "Undergraduate Prerequisites: CAS MA 381 or ENG EK 500 or ENG ME 308; and ENGEC402, ENGEC501 or ENGME510",
        "content": "Introduction to sequential decision making via dynamic programming. The principle of optimality as a unified approach to optimal control of dynamic systems and Markovian decision problems. Applications from control theory and operations research include linear-quadratic problems, the discrete Kalman Filter, inventory control, network, investment, and resource allocation models. Adaptive control and numerical solutions through successive approximation and policy iteration, suboptimal control, and neural network applications involving functional approximations and learning. Same as ENG EC 710 and ENG SE 710. Students may not receive credits for both."
    },
    "ENGME712": {
        "id": "ME712",
        "name": "Applied Mathematics in Mechanics",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: NA"
    },
    "ENGME714": {
        "id": "ME714",
        "name": "Advanced Stochastic Modeling and Simulation",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG EK 500; or equivalent, knowledge of stochastic processes, or consent of the instructor."
    },
    "ENGME720": {
        "id": "ME720",
        "name": "Acoustics II",
        "prereqs": "Undergraduate Prerequisites: ENG ME 520.",
        "content": "Wave equation in cylindrical and spherical co-ordinate systems.  Propagation in waveguides.  Diffraction: the Rayleigh integral and the Helmholtz-Kirchhoff integral.  Green's function and angular spectrum methods.  Diffraction of sound beams: Guassian beams, unfocused and focused sources, and arrays.  Diffraction by apertures, discs and wedges.  Scattering of sound; Rayleigh scattering, scattering cross-section, elastic scatters.  Propagation in inhomogeneous media: rays, the eikonal equation, the Blokhintzev invariant and the acoustic field near caustics.  Absorption and dispersion of acoustic waves.  Transmission and reflection at a fluid-solid interface."
    },
    "ENGME721": {
        "id": "ME721",
        "name": "Acoustic Bubble Dynamics",
        "prereqs": "Undergraduate Prerequisites: ENG ME 520 and ENG ME 542; or equivalent",
        "content": "Bubbles and acoustic cavitation play an important role in many aspects of  application of sonic and ultrasonic energy in fluids and biological tissue.   This course will introduce the study of bubble phenomena in sound fields.   The fundamental physical acoustics of bubbles (and the fundamental physics  which can be illustrated by the study of bubble dynamics) will be stressed.   The family of Rayleigh-Plesset equations for time-dependent bubble behavior  will be derived from the Navier-Stokes equations.  Analytical approximations  to the Rayleigh-Plesset equations in limiting cases will be derived and  studied.  Approximations to the thermodynamic behavior of oscillating  bubbles will be considered in detail.  Thermal, acoustic and viscous  contributions to dissipation will be treated.  Numerical solutions will also  be studied, specifically in the context of highly nonlinear behavior during  acoustically-forced oscillations.  Specific experiments, and experimental  techniques for measuring bubble dynamics will be studied in detail.  Topics  covered will contrast agent microbubbles, acoustics of bubbly liquids,  bubble-mediated bioeffects, shape instabilities, acoustic levitation,  sonoluminescence, heat and mass transfer during bubble oscillations,  sonochemistry and cavitation detection and monitoring."
    },
    "ENGME724": {
        "id": "ME724",
        "name": "Advanced Optimization Theory and Methods",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENGEC524 or consent of instructor."
    },
    "ENGME725": {
        "id": "ME725",
        "name": "Queueing Systems",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG EK 500 or ENG EC 505; or consent of instructor."
    },
    "ENGME726": {
        "id": "ME726",
        "name": "Fundamentals of Biomaterials",
        "prereqs": "Undergraduate Prerequisites: ENG EK 301 ; ENG EK 424 ; CAS CH 101 ; CAS CH 102 ; ENG BE 209.",
        "content": "Provides the chemistry and engineering skills needed to solve challenges in the    biomaterials and tissue engineering area, concentrating on the fundamental    principles in biomedical engineering, material science, and chemistry.  Covers    the structure and properties of hard materials (ceramics and metals) and soft    materials (polymers and hydro-gels).  Same as ENG BE 526, ENG BE 726,ENG MS 726.   Students  may not  receive credit for both."
    },
    "ENGME727": {
        "id": "ME727",
        "name": "Principles and Applications of Tissues",
        "prereqs": "Undergraduate Prerequisites: ENG EK 301 ; ENG EK 424 ; CAS CH 101 ; CAS CH 102 ; ENG BE 209.",
        "content": "Provides the chemistry and engineering skills needed to solve challenges in the  biomaterials and tissue engineering area, concentrating on cell-biomaterial  interactions, soft tissue mechanics and specific research topics.  Students will  write a NIH-style grant proposal on a specific research topic.  Note that the  laboratory portion is not offered in ENG ME 727. Same as ENG BE 527, ENG BE 727, ENG ME 727, ENG MS 727.  Students may not receive credit for both."
    },
    "ENGME733": {
        "id": "ME733",
        "name": "Discrete Event and Hybrid Systems",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG EK 500; or equivalent or consent of instructor."
    },
    "ENGME734": {
        "id": "ME734",
        "name": "Hybrid Systems",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG SE 501 or ENG EC 501 or ENG ME 501; or consent of instructor."
    },
    "ENGME740": {
        "id": "ME740",
        "name": "Vision, Robotics, and Planning",
        "prereqs": "Undergraduate Prerequisites: Graduate standing or consent of instructor.",
        "content": "Methodologies required for constructing and operating intelligent mechanisms. Comprehensive introduction to robot kinematics for motion planning. Dynamics and control of mechanical systems. Formal treatment of differential relationships for understanding the control of forces and torques at the end effector. Discussion of robot vision and sensing and advanced topics in robot mechanics, including elastic effects and kinematic redundancy. Same as ENG SE 740. Students may not receive credits for both."
    },
    "ENGME762": {
        "id": "ME762",
        "name": "Nonlinear Systems and Control",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG ME 501; or ENGEC501 or consent of instructor"
    },
    "ENGME766": {
        "id": "ME766",
        "name": "Advanced Scheduling Models and Methods",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG EK 500 and ENG ME 510."
    },
    "ENGME778": {
        "id": "ME778",
        "name": "Micromachined Tranducers",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG ME 555; or consent of instructor."
    },
    "ENGME781": {
        "id": "ME781",
        "name": "Electroceramics",
        "prereqs": "",
        "content": "This course will explore the structure property relationships and phenomena  in  ceramic materials used in  electronic, dielectric, ferroelectric,  magnetic, and  electrochemical applications.  In particular we will discover  how to  functionalize a component for a particular application - a  capacitor, a  thermistor, actuator, or a fuel cell. Such a discovery process  demands an in- depth understanding of the roles and interrelationships  between the crystal  structure, defect chemistry, microstructure, and  texture in such materials.   Statistical thermodynamics, quantum mechanics,  and solid mechanics principles  will be used as and when necessary in the  course. The course is intended to fit  in the space  and act as a bridge  between solid state theory where the emphasis  is  largely on theory and a  ceramic materials course where the emphasis is  largely on processing. Same as ENG MS 781. Students may not receive credits for both."
    },
    "ENGME785": {
        "id": "ME785",
        "name": "No longer offered",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: ENG ME 585; and consent of instructor."
    },
    "ENGME788": {
        "id": "ME788",
        "name": "Soft Tissue Biomechanics",
        "prereqs": "Undergraduate Prerequisites: ENG BE 420 and ENG ME 521; or ENG BE521 or equivalent with consent of instructor.",
        "content": "This course will introduce students to the mechanics of soft biological  tissue.  In particular, the response of the heart, vasculature, and tissue  scaffolds to mechanical loads from the perspective of nonlinear solid  mechanics will be studied. Constitutive models for hyperelastic materials  will be adapted to biomaterials to handle mechanical characteristics such as  nonlinearity, viscoelasticity, and orthotropy.  Basic experimental methods,  and anatomy and physiology of particular tissue types will also be  introduced. Emphasis is placed on integrating the basic analytical,  experimental, and computational methods for a  more complete understanding  of the underlying mechanobiology.  Meets with ENG BE 788.  Students may not  receive credit for both."
    },
    "ENGME790": {
        "id": "ME790",
        "name": "Graduate Seminar in Mechanical Engineering",
        "prereqs": "",
        "content": "Discussion of current topics in mechanical engineering. Students are expected to attend and actively participate in weekly discussion meetings. Meetings organized around presentations by invited guests who discuss their research programs, strategies, and approaches. 1 cr. P/F. Fall semester."
    },
    "ENGME791": {
        "id": "ME791",
        "name": "Mechanical Engineering PhD Research Placement Program",
        "prereqs": "Graduate Prerequisites: PhD standing",
        "content": "Through trial placements in multiple research labs, first-year PhD students have the opportunity to become familiar with the activities of research groups that are of interest to them. It is recommended that first-year PhD students identify and complete three placements: one in the first semester of their first year and two in their second semester. These placements are intended to help students sample research activities available within Mechanical Engineering and identify the research group and faculty advisor with whom they will perform their dissertation research. Normally each placement will last up to seven weeks. VAR cr. P/F. Either sem."
    },
    "ENGME801": {
        "id": "ME801",
        "name": "Teaching Practicum I",
        "prereqs": "",
        "content": "PhD Requirement. Assist faculty by performing teaching or teaching-related duties, such as preparing and teaching labs and discussion sections, developing teaching materials, assisting with homework preparation and grading, proctoring exams, grading exams or papers."
    },
    "ENGME802": {
        "id": "ME802",
        "name": "Teaching Practicum II",
        "prereqs": "",
        "content": "PhD requirement. Assist faculty by performing teaching or teaching-related duties, such as preparing and teaching labs and discussion sections, developing teaching materials, assisting with homework preparation and grading, proctoring exams, grading exams or papers."
    },
    "ENGME810": {
        "id": "ME810",
        "name": "PhD Internship in Mechanical Engineering",
        "prereqs": "Graduate Prerequisites: Permission of advisor and an approved internship offer; at least two semesters in the ME PhD program.",
        "content": "This course provides ME PhD students the opportunity tom include a paid internship as part of their professional training. The internship must be related to the student's area of study. International students require CPT authorization. Written summary required. Graded P/F. Prerequisite: Permission of advisor and an approved internship offer; at least two complete semesters in the ME PhD program. Full-time (30-40 hours/week for at least 12 weeks) = 4 credits; part-time (15-20 hours/week for at least 12 weeks) = 2 credits."
    },
    "ENGME900": {
        "id": "ME900",
        "name": "PhD Research",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: Graduate standing."
    },
    "ENGME951": {
        "id": "ME951",
        "name": "Independent Study",
        "prereqs": "Graduate Prerequisites: By petition only.",
        "content": "Graduate students may study, under a faculty member's supervision, subjects not covered in a regularly offered course. Final report and/or written examination normally required."
    },
    "ENGME954": {
        "id": "ME954",
        "name": "MS Thesis",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: Graduate standing."
    },
    "ENGME991": {
        "id": "ME991",
        "name": "PhD Dissertation",
        "prereqs": "",
        "content": "Undergraduate Prerequisites: Graduate standing."
    }
}
